[
  {
    "cluster_id": 1,
    "queries": [
      "What are the latitude and longitude coordinates for 1600 Amphitheatre Parkway, Mountain View, CA?",
      "Can you provide the geographic coordinates for 221B Baker Street, London?",
      "Find the latitude and longitude of 350 Fifth Avenue, New York, NY 10118.",
      "Give me the geocoordinates of 1 Infinite Loop, Cupertino, CA 95014.",
      "Retrieve the latitude and longitude for the address 10 Downing Street, London.",
      "What are the coordinates for 4059 Mt Lee Dr, Hollywood, CA 90068?",
      "Obtain the latitude and longitude for 500 S Buena Vista St, Burbank, CA 91521.",
      "Get the geolocation coordinates for 1600 Pennsylvania Ave NW, Washington, DC 20500.",
      "Provide the geographic coordinates for 11 Wall Street, New York, NY 10005.",
      "Find the latitude and longitude for 700 Exposition Park Dr, Los Angeles, CA 90037.",
      "What are the latitude and longitude values for 221 Main St, Cambridge, MA 02142?",
      "Get the coordinates for 77 Massachusetts Ave, Cambridge, MA 02139.",
      "Provide the latitude and longitude for 405 Howard St, San Francisco, CA 94105.",
      "What are the latitude and longitude coordinates for 1600 Pennsylvania Ave NW, Washington, DC 20500?",
      "Can you provide the geocoordinates for 350 Fifth Avenue, New York, NY 10118?",
      "Find the latitude and longitude for 1 Infinite Loop, Cupertino, CA 95014.",
      "Get the geographic coordinates for 221B Baker Street, London NW1 6XE, UK.",
      "Retrieve the latitude and longitude for 10 Downing Street, London SW1A 2AA, UK.",
      "What are the GPS coordinates for 4059 Mt Lee Dr, Hollywood, CA 90068?",
      "Provide the latitude and longitude for 1600 Amphitheatre Parkway, Mountain View, CA 94043.",
      "Find the coordinates of 11 Wall Street, New York, NY 10005.",
      "Get the geolocation for 500 S Buena Vista St, Burbank, CA 91521.",
      "Can you give me the lat and lng for 1 Microsoft Way, Redmond, WA 98052?",
      "What is the latitude and longitude of 3500 Deer Creek Road, Palo Alto, CA 94304?",
      "Retrieve the geocoordinates for 200 Central Park South, New York, NY 10019.",
      "Find the latitude and longitude for 30 Rockefeller Plaza, New York, NY 10112.",
      "What are the latitude and longitude for 1600 Amphitheatre Parkway, Mountain View, CA?",
      "Can you provide the geographic coordinates for 1 Infinite Loop, Cupertino, CA 95014?",
      "Get the coordinates for the address 221B Baker Street, London.",
      "What are the GPS coordinates for 500 S Buena Vista St, Burbank, CA 91521?",
      "Provide the geocoordinates for 4059 Mt Lee Dr, Hollywood, CA 90068.",
      "Find the latitude and longitude for 1600 Pennsylvania Avenue NW, Washington, DC 20500.",
      "Can you get the geographic coordinates for 1 Microsoft Way, Redmond, WA 98052?",
      "What are the latitude and longitude for Eiffel Tower, Champ de Mars, Paris?",
      "Obtain the GPS coordinates of 3500 Deer Creek Road, Palo Alto, CA 94304.",
      "Get the latitude and longitude for 221 Main Street, San Francisco, CA 94105.",
      "Provide the coordinates for 742 Evergreen Terrace, Springfield.",
      "Can you provide the geocoordinates for 221B Baker Street, London?",
      "Find the latitude and longitude for 350 Fifth Avenue, New York, NY 10118.",
      "Give me the geographic coordinates of 1 Infinite Loop, Cupertino, CA.",
      "What is the latitude and longitude of the Eiffel Tower, Paris, France?",
      "Get the coordinates for 10 Downing Street, London.",
      "Locate the latitude and longitude for 500 S Buena Vista St, Burbank, CA 91521.",
      "Provide the geolocation for 1600 Pennsylvania Avenue NW, Washington, DC.",
      "Find the latitude and longitude of 405 Lexington Ave, New York, NY 10174.",
      "What are the coordinates for 4 Privet Drive, Little Whinging, Surrey?",
      "Get the geocoordinates for 3500 Deer Creek Road, Palo Alto, CA.",
      "Can you find the latitude and longitude of 700 Exposition Park Dr, Los Angeles, CA?",
      "Provide the geographic coordinates for 221 Main Street, San Francisco, CA.",
      "Find the geocoordinates of 221B Baker Street, London.",
      "Can you provide the latitude and longitude for the address 350 Fifth Avenue, New York, NY 10118?",
      "Get the geographic coordinates for 1 Infinite Loop, Cupertino, CA 95014.",
      "Locate the latitude and longitude for 10 Downing Street, London.",
      "What are the coordinates for 500 S Buena Vista St, Burbank, CA 91521?",
      "Find the geolocation coordinates for 1600 Pennsylvania Avenue NW, Washington, DC 20500.",
      "Provide the latitude and longitude for 4059 Mt Lee Dr, Hollywood, CA 90068.",
      "Get the geocoordinates of 11 Wall Street, New York, NY 10005.",
      "What is the latitude and longitude for 3500 Deer Creek Road, Palo Alto, CA?",
      "Find the geographic coordinates of 2211 North First Street, San Jose, CA 95131.",
      "Provide the latitude and longitude for 600 Congress Ave, Austin, TX 78701.",
      "Get the latitude and longitude coordinates for 160 Spear St, San Francisco, CA 94105.",
      "Can you find the geographic coordinates of 1 Infinite Loop, Cupertino, CA 95014?",
      "Get the latitude and longitude for 350 Fifth Avenue, New York, NY 10118.",
      "Provide the geocoordinates for 221B Baker Street, London.",
      "Find the latitude and longitude of 10 Downing Street, London, UK.",
      "What is the latitude and longitude of 500 S Buena Vista Street, Burbank, CA?",
      "Retrieve the geographic coordinates for 4059 Mt Lee Dr, Hollywood, CA.",
      "Convert the address 1600 Pennsylvania Avenue NW, Washington, DC 20500 into latitude and longitude.",
      "Find the GPS coordinates for 1 Microsoft Way, Redmond, WA 98052.",
      "Get the latitude and longitude for 3500 Deer Creek Road, Palo Alto, CA.",
      "What are the latitude and longitude coordinates of 4 Yawkey Way, Boston, MA?",
      "Provide the geographic coordinates for 77 Massachusetts Avenue, Cambridge, MA.",
      "Get the latitude and longitude coordinates for 30 Rockefeller Plaza, New York, NY 10112.",
      "Find the latitude and longitude of 1 Infinite Loop, Cupertino, CA 95014.",
      "Get the geographic coordinates for 221B Baker Street, London.",
      "What is the lat,lng for 500 S Buena Vista St, Burbank, CA 91521?",
      "Provide the geocoding data for 10 Downing Street, London SW1A 2AA.",
      "Retrieve the coordinates for 4059 Mt Lee Dr, Hollywood, CA 90068.",
      "Give me the latitude and longitude for 1600 Pennsylvania Avenue NW, Washington, DC 20500.",
      "Find the geocode for 4 Yawkey Way, Boston, MA 02215.",
      "What are the coordinates of 3500 Deer Creek Road, Palo Alto, CA?",
      "Get latitude and longitude for 2211 N First St, San Jose, CA 95131.",
      "Provide geocoordinates for 11 Wall Street, New York, NY 10005.",
      "Find the latitude and longitude of 500 Terry Francois Blvd, San Francisco, CA 94158.",
      "Provide the latitude and longitude for 10 Downing Street, London, UK.",
      "What is the geocode for 4059 Mt Lee Dr, Hollywood, CA 90068?",
      "Retrieve the latitude and longitude of 500 S Buena Vista St, Burbank, CA 91521.",
      "Find the coordinates for 1600 Pennsylvania Avenue NW, Washington, DC 20500.",
      "Get the latitude and longitude for 11 Wall Street, New York, NY 10005.",
      "What are the geographic coordinates of 3500 Deer Creek Road, Palo Alto, CA?",
      "Provide the geocode for 4 Privet Drive, Little Whinging, Surrey.",
      "Find the latitude and longitude for 221 Main Street, Cambridge, MA 02142.",
      "Get the coordinates for 1 Microsoft Way, Redmond, WA 98052.",
      "What are the latitude and longitude coordinates for the address 1600 Amphitheatre Parkway, Mountain View, CA?",
      "Can you provide the geocoordinates of 221B Baker Street, London?",
      "Find the latitude and longitude for the address 350 Fifth Avenue, New York, NY 10118.",
      "I need the geographic coordinates for 1 Infinite Loop, Cupertino, CA.",
      "Get the latitude and longitude of the Empire State Building at 20 W 34th St, New York, NY.",
      "What are the coordinates for the White House located at 1600 Pennsylvania Avenue NW, Washington, DC?",
      "Provide the latitude and longitude for the Eiffel Tower, Champ de Mars, Paris."
    ]
  },
  {
    "cluster_id": 3,
    "queries": [
      "Get the latest news headlines for Japan.",
      "Get the latest news headlines for Brazil.",
      "Get the latest news headlines for Germany.",
      "Get the latest news headlines for South Africa.",
      "Get the latest news headlines for Australia.",
      "Get the latest news headlines for Canada.",
      "Get the latest news headlines for Italy.",
      "Get the latest news headlines for Mexico.",
      "Get the latest news headlines for Sweden.",
      "Get the latest news headlines for India.",
      "Fetch the top technology stories in Germany.",
      "Fetch the top environmental stories in Brazil.",
      "Fetch the top healthcare stories in Japan.",
      "Fetch the top sports stories in Australia.",
      "Fetch the top economic stories in India.",
      "Fetch the top political stories in Canada.",
      "Fetch the top entertainment stories in South Korea.",
      "Fetch the top scientific stories in Sweden.",
      "Fetch the top education stories in France.",
      "Fetch the top travel stories in Italy.",
      "Show me current climate change news in Germany.",
      "Show me current artificial intelligence news in Japan.",
      "Show me current space exploration news in Brazil.",
      "Show me current cryptocurrency news in South Korea.",
      "Show me current renewable energy news in Canada.",
      "Show me current electric vehicle news in Australia.",
      "Show me current biotechnology news in Sweden.",
      "Show me current cybersecurity news in India.",
      "Show me current quantum computing news in the United Kingdom.",
      "Show me current health care news in France.",
      "Retrieve top headlines about renewable energy in Germany.",
      "Retrieve top headlines about artificial intelligence in Japan.",
      "Retrieve top headlines about space exploration in Canada.",
      "Retrieve top headlines about sustainable agriculture in Brazil.",
      "Retrieve top headlines about cybersecurity in Australia.",
      "Retrieve top headlines about electric vehicles in Norway.",
      "Retrieve top headlines about climate change policy in the United Kingdom.",
      "Retrieve top headlines about biotechnology advancements in South Korea.",
      "Retrieve top headlines about quantum computing in the United States.",
      "Retrieve top headlines about urban transportation innovation in the Netherlands.",
      "Find the most recent technology news articles in Germany.",
      "Find the most recent health news articles in Brazil.",
      "Find the most recent environmental news articles in Australia.",
      "Find the most recent financial news articles in Japan.",
      "Find the most recent political news articles in Canada.",
      "Find the most recent sports news articles in South Africa.",
      "Find the most recent entertainment news articles in Italy.",
      "Find the most recent scientific news articles in Sweden.",
      "Find the most recent educational news articles in India.",
      "Find the most recent cultural news articles in Mexico.",
      "Get breaking news in Japan.",
      "Get breaking news in Brazil.",
      "Get breaking news in South Africa.",
      "Get breaking news in Australia.",
      "Get breaking news in Germany.",
      "Get breaking news in Canada.",
      "Get breaking news in Argentina.",
      "Get breaking news in India.",
      "Get breaking news in Egypt.",
      "Get breaking news in Sweden.",
      "Fetch the latest technology headlines for Germany.",
      "Fetch the latest health headlines for Brazil.",
      "Fetch the latest entertainment headlines for Japan.",
      "Fetch the latest sports headlines for Australia.",
      "Fetch the latest business headlines for Canada.",
      "Fetch the latest science headlines for South Africa.",
      "Fetch the latest environment headlines for New Zealand.",
      "Fetch the latest politics headlines for India.",
      "Fetch the latest education headlines for United Kingdom.",
      "Fetch the latest travel headlines for Italy.",
      "Show top news in Germany.",
      "Show top news in Brazil.",
      "Show top news in Japan.",
      "Show top news in South Africa.",
      "Show top news in Canada.",
      "Show top news in Australia.",
      "Show top news in India.",
      "Show top news in Mexico.",
      "Show top news in Sweden.",
      "Show top news in New Zealand.",
      "Retrieve recent articles relating to climate change for Germany.",
      "Retrieve recent articles relating to renewable energy for Brazil.",
      "Retrieve recent articles relating to artificial intelligence for Japan.",
      "Retrieve recent articles relating to cryptocurrency regulation for South Korea.",
      "Retrieve recent articles relating to space exploration for Canada.",
      "Retrieve recent articles relating to electric vehicle adoption for Norway.",
      "Retrieve recent articles relating to quantum computing for Australia.",
      "Retrieve recent articles relating to cybersecurity threats for the United States.",
      "Retrieve recent articles relating to sustainable agriculture for Kenya.",
      "Retrieve recent articles relating to biotechnology advances for Switzerland.",
      "Get current headlines in the technology category for Germany.",
      "Get current headlines in the health category for Australia.",
      "Get current headlines in the entertainment category for Brazil.",
      "Get current headlines in the science category for Japan.",
      "Get current headlines in the business category for Canada.",
      "Get current headlines in the sports category for Spain.",
      "Get current headlines in the environment category for South Africa.",
      "Get current headlines in the travel category for Italy.",
      "Get current headlines in the education category for India.",
      "Get current headlines in the politics category for the United Kingdom."
    ]
  },
  {
    "cluster_id": 4,
    "queries": [
      "What is the geolocation of IP address 192.168.1.1?",
      "What is the geolocation of IP address 203.0.113.45?",
      "What is the geolocation of IP address 85.214.132.117?",
      "What is the geolocation of IP address 172.217.10.14?",
      "What is the geolocation of IP address 98.138.219.231?",
      "What is the geolocation of IP address 66.249.66.1?",
      "What is the geolocation of IP address 143.110.134.67?",
      "What is the geolocation of IP address 150.230.56.89?",
      "What is the geolocation of IP address 45.79.23.101?",
      "What is the geolocation of IP address 203.119.45.78?",
      "Fetch the coordinate information for 192.168.1.1.",
      "Fetch the coordinate information for 8.8.8.8.",
      "Fetch the coordinate information for 203.0.113.45.",
      "Fetch the coordinate information for 172.217.10.14.",
      "Fetch the coordinate information for 54.243.123.67.",
      "Fetch the coordinate information for 45.79.120.32.",
      "Fetch the coordinate information for 198.51.100.22.",
      "Fetch the coordinate information for 151.101.1.69.",
      "Fetch the coordinate information for 139.130.4.5.",
      "Fetch the coordinate information for 66.249.66.1.",
      "Retrieve the latitude and longitude for IP 192.168.1.1.",
      "Retrieve the latitude and longitude for IP 203.0.113.45.",
      "Retrieve the latitude and longitude for IP 8.8.8.8.",
      "Retrieve the latitude and longitude for IP 172.217.14.238.",
      "Retrieve the latitude and longitude for IP 54.239.28.85.",
      "Retrieve the latitude and longitude for IP 198.51.100.22.",
      "Retrieve the latitude and longitude for IP 145.97.39.155.",
      "Retrieve the latitude and longitude for IP 67.215.65.132.",
      "Retrieve the latitude and longitude for IP 91.198.174.192.",
      "Retrieve the latitude and longitude for IP 156.154.70.1.",
      "Get the coordinate data associated with 192.168.1.1.",
      "Get the coordinate data associated with 203.0.113.45.",
      "Get the coordinate data associated with 172.217.14.206.",
      "Get the coordinate data associated with 8.8.8.8.",
      "Get the coordinate data associated with 54.239.28.85.",
      "Get the coordinate data associated with 104.244.42.65.",
      "Get the coordinate data associated with 185.199.108.153.",
      "Get the coordinate data associated with 66.249.66.1.",
      "Get the coordinate data associated with 151.101.65.121.",
      "Get the coordinate data associated with 45.79.1.23.",
      "Look up the geolocation details for 192.168.1.1.",
      "Look up the geolocation details for 203.0.113.45.",
      "Look up the geolocation details for 172.217.16.142.",
      "Look up the geolocation details for 85.214.132.117.",
      "Look up the geolocation details for 54.239.28.85.",
      "Look up the geolocation details for 104.244.42.65.",
      "Look up the geolocation details for 199.195.250.93.",
      "Look up the geolocation details for 143.110.185.52.",
      "Look up the geolocation details for 66.249.66.1.",
      "Look up the geolocation details for 8.8.8.8.",
      "Show detailed location info (lat, long) for IP 192.168.1.1.",
      "Show detailed location info (lat, long) for IP 203.0.113.45.",
      "Show detailed location info (lat, long) for IP 8.8.8.8.",
      "Show detailed location info (lat, long) for IP 172.217.14.238.",
      "Show detailed location info (lat, long) for IP 54.85.132.22.",
      "Show detailed location info (lat, long) for IP 45.33.32.156.",
      "Show detailed location info (lat, long) for IP 151.101.1.69.",
      "Show detailed location info (lat, long) for IP 66.249.66.1.",
      "Show detailed location info (lat, long) for IP 138.197.64.45.",
      "Show detailed location info (lat, long) for IP 89.160.20.112.",
      "Find the geographic coordinates of IP address 192.168.1.1.",
      "Find the geographic coordinates of IP address 203.0.113.45.",
      "Find the geographic coordinates of IP address 8.8.8.8.",
      "Find the geographic coordinates of IP address 172.217.10.14.",
      "Find the geographic coordinates of IP address 45.79.120.22.",
      "Find the geographic coordinates of IP address 139.130.4.5.",
      "Find the geographic coordinates of IP address 151.101.1.69.",
      "Find the geographic coordinates of IP address 66.249.66.1.",
      "Find the geographic coordinates of IP address 54.239.28.85.",
      "Find the geographic coordinates of IP address 104.244.42.1.",
      "What's the geolocation for IP 192.168.1.1?",
      "What's the geolocation for IP 203.0.113.45?",
      "What's the geolocation for IP 8.8.8.8?",
      "What's the geolocation for IP 172.217.16.142?",
      "What's the geolocation for IP 45.79.23.12?",
      "What's the geolocation for IP 54.239.28.85?",
      "What's the geolocation for IP 149.56.112.78?",
      "What's the geolocation for IP 67.215.65.132?",
      "What's the geolocation for IP 98.137.246.8?",
      "What's the geolocation for IP 203.208.60.1?",
      "Retrieve full geolocation for IP 192.168.1.1.",
      "Retrieve full geolocation for IP 8.8.8.8.",
      "Retrieve full geolocation for IP 203.0.113.45.",
      "Retrieve full geolocation for IP 172.217.16.142.",
      "Retrieve full geolocation for IP 54.239.28.85.",
      "Retrieve full geolocation for IP 145.87.23.109.",
      "Retrieve full geolocation for IP 198.51.100.27.",
      "Retrieve full geolocation for IP 65.52.108.23.",
      "Retrieve full geolocation for IP 23.45.67.89.",
      "Retrieve full geolocation for IP 91.198.174.192.",
      "Provide the location details for IP address 192.168.1.1.",
      "Provide the location details for IP address 203.0.113.45.",
      "Provide the location details for IP address 8.8.8.8.",
      "Provide the location details for IP address 172.217.16.195.",
      "Provide the location details for IP address 54.239.28.85.",
      "Provide the location details for IP address 151.101.1.69.",
      "Provide the location details for IP address 185.60.216.35.",
      "Provide the location details for IP address 45.79.23.12.",
      "Provide the location details for IP address 66.249.66.1.",
      "Provide the location details for IP address 104.244.42.65."
    ]
  },
  {
    "cluster_id": 9,
    "queries": [
      "Generate a QR code image for the URL https://example.com",
      "Create a QR code from the text 'Hello World'",
      "Get a downloadable QR code PNG for the URL https://openai.com",
      "Produce a QR code image for the string 'Contact: John Doe, +1234567890'",
      "Generate a QR code for the URL https://mywebsite.org/about",
      "Create a QR code image from the text 'Event: Conference 2024 on May 5th'",
      "Get a QR code for the URL https://shop.example.com/product/123",
      "Generate a QR code image for the string 'WiFi Password: MySecret123'",
      "Create a QR code for the URL https://docs.api.com/v1/reference",
      "Produce a QR code image from the text 'Location: 123 Main St, Springfield'",
      "Generate a QR code from the URL https://blog.example.net/article?id=456",
      "Create a QR code image for the string 'Promo Code: SAVE20'",
      "Get a QR code image for the URL https://example.com/signup",
      "Create a QR code from the text 'Hello World!'",
      "Can you produce a QR code image for the string 'OpenAI API documentation'?",
      "I need a QR code generated for the website https://openai.com",
      "Please generate a downloadable QR code for the URL https://github.com",
      "Make a QR code image from the text 'Scan me to visit example.com!'",
      "Generate a QR code for the string 'Contact: info@example.com'",
      "Create a QR code image for the URL https://news.ycombinator.com",
      "Convert the text 'Welcome to our event 2024' into a QR code",
      "Produce a QR code image for the link https://www.wikipedia.org",
      "Generate a QR code for the string 'Discount code: SAVE20'",
      "Create a QR code image for the URL https://www.twitter.com",
      "Make a QR code from the text 'Join our newsletter at subscribe@example.com'",
      "Create a QR code for the text 'Hello World!'",
      "Show me a QR code for the website https://openai.com",
      "I need a QR code image for the string 'Contact: John Doe, +1234567890'",
      "Make a QR code for the URL https://github.com",
      "Generate a downloadable QR code for the text 'Event: Meetup at 5 PM'",
      "Create a QR code image from the URL https://news.ycombinator.com",
      "Provide a QR code for the string 'WiFi Password: mysecretpassword123'",
      "Make a QR code for the URL https://weather.com/today",
      "Generate a QR code image for the text 'Scan to follow me on Instagram'",
      "Create a QR code for the URL https://linkedin.com/in/janedoe",
      "Produce a QR code image for the text 'Discount code: SAVE20'",
      "I want a QR code generated from the URL https://example.org/download",
      "Create a QR code from the text 'Welcome to OpenAI!'",
      "Produce a QR code for the URL https://openai.com/blog",
      "Generate a QR code image for the string 'Contact: info@example.com'",
      "Create a downloadable QR code for the URL https://github.com",
      "Make a QR code from the text 'Event Date: 2024-07-01'",
      "Generate a QR code image for the URL https://maps.google.com",
      "Create a QR code from the string 'Scan to join our newsletter'",
      "Produce a QR code image for the URL https://example.org/about",
      "Generate a QR code for the text 'Discount Code: SAVE20'",
      "Create a QR code image from the URL https://twitter.com/OpenAI",
      "Make a QR code for the string 'Hello, World!'",
      "Generate a QR code image for the URL https://linkedin.com/in/example",
      "Provide a downloadable QR code for the URL https://www.wikipedia.org",
      "Make a QR code image for the string 'Contact us at contact@example.com'",
      "Generate a QR code for the URL https://shop.example.com/products/123",
      "Create a QR code image from the text 'Event starts at 7 PM on July 10'",
      "Produce a QR code for the string 'https://github.com/openai'",
      "Generate a QR code image for the URL https://news.example.com/latest",
      "Create a QR code from the text 'Scan to join our newsletter'",
      "Make a QR code image for the URL https://example.com/download/app.apk",
      "Generate a QR code for the string 'Happy Birthday, John!'",
      "Provide a QR code image for the URL https://blog.example.com/post/456",
      "Create a QR code from the text 'Follow us on Twitter @example'",
      "Create a downloadable QR code for the text 'Hello World!'",
      "Produce a QR code from the URL https://openai.com",
      "Make a QR code image for the string 'Contact: John Doe, +1234567890'",
      "Generate a QR code for the URL https://github.com",
      "Create a QR code from the text 'Event: Meeting at 3 PM'",
      "Generate a QR code image for the URL https://news.ycombinator.com",
      "Create a QR code for the string 'WiFi Network: MyHomeWiFi, Password: 12345678'",
      "Produce a QR code for the URL https://weather.com",
      "Generate a QR code image from the text 'Scan to join the newsletter!'",
      "Produce a QR code image from the URL https://openai.com/blog",
      "I need a QR code for the website https://openai.com",
      "Can you generate a QR code for the string 'Contact: 123-456-7890'?",
      "Please provide a QR code image for the URL https://mywebsite.org",
      "Make a QR code for the text 'Event: Conference 2024'",
      "Generate a downloadable QR code image for https://shop.example.com/product/123",
      "Create a QR code from the phrase 'Scan to join our newsletter!'",
      "I want a QR code for the URL https://github.com/user/repo",
      "Produce a QR code image for the text 'WiFi Password: guest1234'",
      "Generate a QR code for the link https://docs.example.com/api",
      "Make a QR code image from the text 'Follow us on social media!'",
      "Create a QR code for the URL https://blog.example.net/article/456",
      "Generate a QR code for the URL https://example.com",
      "Create a QR code image from the string 'Hello World'",
      "Please provide a downloadable QR code for the URL https://openai.com",
      "Make a QR code from the text 'Contact: John Doe, +1234567890'",
      "Generate a QR code image for the URL https://github.com",
      "Create a QR code from the string 'Event: Conference 2024, Date: June 15'",
      "Generate a QR code for the URL https://news.ycombinator.com",
      "Produce a QR code image from the text 'WiFi Network: MyNetwork, Password: password123'",
      "Create a QR code for the URL https://www.wikipedia.org",
      "Generate a QR code from the string 'Scan this code to get 20% off!'",
      "Make a QR code image for the URL https://openweathermap.org",
      "Create a QR code from the text 'Join our Slack at https://join.slack.com/example'",
      "Generate a downloadable QR code image for the URL https://www.python.org",
      "I need a downloadable QR code for the link https://openai.com",
      "Please provide a QR code image for the string 'Contact: 123-456-7890'",
      "Make a QR code for https://github.com with a downloadable PNG file",
      "Get me a QR code image for the URL https://news.ycombinator.com",
      "Generate a QR code from the text 'Event Date: 2024-07-01'",
      "Create a QR code image for the website https://weather.com"
    ]
  }
]