[
  {
    "cluster_id": 1,
    "queries": [
      "What are the latitude and longitude coordinates for 1600 Amphitheatre Parkway, Mountain View, CA?",
      "Can you provide the geographic coordinates for 221B Baker Street, London?",
      "Find the latitude and longitude of 350 Fifth Avenue, New York, NY 10118.",
      "Give me the geocoordinates of 1 Infinite Loop, Cupertino, CA 95014.",
      "Retrieve the latitude and longitude for the address 10 Downing Street, London.",
      "What are the coordinates for 4059 Mt Lee Dr, Hollywood, CA 90068?",
      "Obtain the latitude and longitude for 500 S Buena Vista St, Burbank, CA 91521.",
      "Get the geolocation coordinates for 1600 Pennsylvania Ave NW, Washington, DC 20500.",
      "Provide the geographic coordinates for 11 Wall Street, New York, NY 10005.",
      "Find the latitude and longitude for 700 Exposition Park Dr, Los Angeles, CA 90037.",
      "What are the latitude and longitude values for 221 Main St, Cambridge, MA 02142?",
      "Get the coordinates for 77 Massachusetts Ave, Cambridge, MA 02139.",
      "Provide the latitude and longitude for 405 Howard St, San Francisco, CA 94105.",
      "What are the latitude and longitude coordinates for 1600 Pennsylvania Ave NW, Washington, DC 20500?",
      "Can you provide the geocoordinates for 350 Fifth Avenue, New York, NY 10118?",
      "Find the latitude and longitude for 1 Infinite Loop, Cupertino, CA 95014.",
      "Get the geographic coordinates for 221B Baker Street, London NW1 6XE, UK.",
      "Retrieve the latitude and longitude for 10 Downing Street, London SW1A 2AA, UK.",
      "What are the GPS coordinates for 4059 Mt Lee Dr, Hollywood, CA 90068?",
      "Provide the latitude and longitude for 1600 Amphitheatre Parkway, Mountain View, CA 94043.",
      "Find the coordinates of 11 Wall Street, New York, NY 10005.",
      "Get the geolocation for 500 S Buena Vista St, Burbank, CA 91521.",
      "Can you give me the lat and lng for 1 Microsoft Way, Redmond, WA 98052?",
      "What is the latitude and longitude of 3500 Deer Creek Road, Palo Alto, CA 94304?",
      "Retrieve the geocoordinates for 200 Central Park South, New York, NY 10019.",
      "Find the latitude and longitude for 30 Rockefeller Plaza, New York, NY 10112.",
      "What are the latitude and longitude for 1600 Amphitheatre Parkway, Mountain View, CA?",
      "Can you provide the geographic coordinates for 1 Infinite Loop, Cupertino, CA 95014?",
      "Get the coordinates for the address 221B Baker Street, London.",
      "What are the GPS coordinates for 500 S Buena Vista St, Burbank, CA 91521?",
      "Provide the geocoordinates for 4059 Mt Lee Dr, Hollywood, CA 90068.",
      "Find the latitude and longitude for 1600 Pennsylvania Avenue NW, Washington, DC 20500.",
      "Can you get the geographic coordinates for 1 Microsoft Way, Redmond, WA 98052?",
      "What are the latitude and longitude for Eiffel Tower, Champ de Mars, Paris?",
      "Obtain the GPS coordinates of 3500 Deer Creek Road, Palo Alto, CA 94304.",
      "Get the latitude and longitude for 221 Main Street, San Francisco, CA 94105.",
      "Provide the coordinates for 742 Evergreen Terrace, Springfield.",
      "Can you provide the geocoordinates for 221B Baker Street, London?",
      "Find the latitude and longitude for 350 Fifth Avenue, New York, NY 10118.",
      "Give me the geographic coordinates of 1 Infinite Loop, Cupertino, CA.",
      "What is the latitude and longitude of the Eiffel Tower, Paris, France?",
      "Get the coordinates for 10 Downing Street, London.",
      "Locate the latitude and longitude for 500 S Buena Vista St, Burbank, CA 91521.",
      "Provide the geolocation for 1600 Pennsylvania Avenue NW, Washington, DC.",
      "Find the latitude and longitude of 405 Lexington Ave, New York, NY 10174.",
      "What are the coordinates for 4 Privet Drive, Little Whinging, Surrey?",
      "Get the geocoordinates for 3500 Deer Creek Road, Palo Alto, CA.",
      "Can you find the latitude and longitude of 700 Exposition Park Dr, Los Angeles, CA?",
      "Provide the geographic coordinates for 221 Main Street, San Francisco, CA.",
      "Find the geocoordinates of 221B Baker Street, London.",
      "Can you provide the latitude and longitude for the address 350 Fifth Avenue, New York, NY 10118?",
      "Get the geographic coordinates for 1 Infinite Loop, Cupertino, CA 95014.",
      "Locate the latitude and longitude for 10 Downing Street, London.",
      "What are the coordinates for 500 S Buena Vista St, Burbank, CA 91521?",
      "Find the geolocation coordinates for 1600 Pennsylvania Avenue NW, Washington, DC 20500.",
      "Provide the latitude and longitude for 4059 Mt Lee Dr, Hollywood, CA 90068.",
      "Get the geocoordinates of 11 Wall Street, New York, NY 10005.",
      "What is the latitude and longitude for 3500 Deer Creek Road, Palo Alto, CA?",
      "Find the geographic coordinates of 2211 North First Street, San Jose, CA 95131.",
      "Provide the latitude and longitude for 600 Congress Ave, Austin, TX 78701.",
      "Get the latitude and longitude coordinates for 160 Spear St, San Francisco, CA 94105.",
      "Can you find the geographic coordinates of 1 Infinite Loop, Cupertino, CA 95014?",
      "Get the latitude and longitude for 350 Fifth Avenue, New York, NY 10118.",
      "Provide the geocoordinates for 221B Baker Street, London.",
      "Find the latitude and longitude of 10 Downing Street, London, UK.",
      "What is the latitude and longitude of 500 S Buena Vista Street, Burbank, CA?",
      "Retrieve the geographic coordinates for 4059 Mt Lee Dr, Hollywood, CA.",
      "Convert the address 1600 Pennsylvania Avenue NW, Washington, DC 20500 into latitude and longitude.",
      "Find the GPS coordinates for 1 Microsoft Way, Redmond, WA 98052.",
      "Get the latitude and longitude for 3500 Deer Creek Road, Palo Alto, CA.",
      "What are the latitude and longitude coordinates of 4 Yawkey Way, Boston, MA?",
      "Provide the geographic coordinates for 77 Massachusetts Avenue, Cambridge, MA.",
      "Get the latitude and longitude coordinates for 30 Rockefeller Plaza, New York, NY 10112.",
      "Find the latitude and longitude of 1 Infinite Loop, Cupertino, CA 95014.",
      "Get the geographic coordinates for 221B Baker Street, London.",
      "What is the lat,lng for 500 S Buena Vista St, Burbank, CA 91521?",
      "Provide the geocoding data for 10 Downing Street, London SW1A 2AA.",
      "Retrieve the coordinates for 4059 Mt Lee Dr, Hollywood, CA 90068.",
      "Give me the latitude and longitude for 1600 Pennsylvania Avenue NW, Washington, DC 20500.",
      "Find the geocode for 4 Yawkey Way, Boston, MA 02215.",
      "What are the coordinates of 3500 Deer Creek Road, Palo Alto, CA?",
      "Get latitude and longitude for 2211 N First St, San Jose, CA 95131.",
      "Provide geocoordinates for 11 Wall Street, New York, NY 10005.",
      "Find the latitude and longitude of 500 Terry Francois Blvd, San Francisco, CA 94158.",
      "Provide the latitude and longitude for 10 Downing Street, London, UK.",
      "What is the geocode for 4059 Mt Lee Dr, Hollywood, CA 90068?",
      "Retrieve the latitude and longitude of 500 S Buena Vista St, Burbank, CA 91521.",
      "Find the coordinates for 1600 Pennsylvania Avenue NW, Washington, DC 20500.",
      "Get the latitude and longitude for 11 Wall Street, New York, NY 10005.",
      "What are the geographic coordinates of 3500 Deer Creek Road, Palo Alto, CA?",
      "Provide the geocode for 4 Privet Drive, Little Whinging, Surrey.",
      "Find the latitude and longitude for 221 Main Street, Cambridge, MA 02142.",
      "Get the coordinates for 1 Microsoft Way, Redmond, WA 98052.",
      "What are the latitude and longitude coordinates for the address 1600 Amphitheatre Parkway, Mountain View, CA?",
      "Can you provide the geocoordinates of 221B Baker Street, London?",
      "Find the latitude and longitude for the address 350 Fifth Avenue, New York, NY 10118.",
      "I need the geographic coordinates for 1 Infinite Loop, Cupertino, CA.",
      "Get the latitude and longitude of the Empire State Building at 20 W 34th St, New York, NY.",
      "What are the coordinates for the White House located at 1600 Pennsylvania Avenue NW, Washington, DC?",
      "Provide the latitude and longitude for the Eiffel Tower, Champ de Mars, Paris."
    ]
  },
  {
    "cluster_id": 2,
    "queries": [
      "What is the address for the coordinates latitude 40.7128 and longitude -74.0060?",
      "Can you find the location details for lat 34.0522 and lon -118.2437?",
      "Please provide the full address at latitude 51.5074 and longitude -0.1278.",
      "Give me the address corresponding to the coordinates lat 48.8566 and lng 2.3522.",
      "Find the street address for the point with latitude 35.6895 and longitude 139.6917.",
      "What location does the latitude 55.7558 and longitude 37.6173 correspond to?",
      "Retrieve the address for lat 37.7749 and lon -122.4194 coordinates.",
      "I need the location name or address for latitude 52.5200 and longitude 13.4050.",
      "Get the address from GPS coordinates lat 41.8781 and lng -87.6298.",
      "Tell me the place details at latitude 19.4326 and longitude -99.1332.",
      "Find the full address for coordinates lat 1.3521 and lon 103.8198.",
      "What is the textual address for latitude 43.6532 and longitude -79.3832?",
      "Provide the address corresponding to lat 39.9042 and lon 116.4074.",
      "What is the address at latitude 40.7128 and longitude -74.0060?",
      "Can you find the location details for coordinates lat: 34.0522, lon: -118.2437?",
      "Please provide the full address for latitude 51.5074 and longitude -0.1278.",
      "Get me the address corresponding to lat 48.8566 and lng 2.3522.",
      "What location is found at latitude 35.6895 and longitude 139.6917?",
      "Find the address for coordinates latitude 55.7558 and longitude 37.6173.",
      "Retrieve the place name or address at lat 52.52 and lon 13.4050.",
      "Given the latitude 37.7749 and longitude -122.4194, what is the address?",
      "Show me the location information for lat 41.9028, lng 12.4964.",
      "Provide the address details for latitude 19.4326 and longitude -99.1332.",
      "What is the address at lat: -33.8688 and lon: 151.2093?",
      "Find the place located at latitude 59.3293 and longitude 18.0686.",
      "Can you get the full address for coordinates lat 43.6532 and lon -79.3832?",
      "Give me the full address at latitude 51.5074 and longitude -0.1278.",
      "Find the nearest address to the coordinate 48.8566, 2.3522.",
      "Retrieve the address from the latitude 35.6895 and longitude 139.6917.",
      "What location corresponds to the coordinates lat 37.7749 and lon -122.4194?",
      "Get me the address for latitude 55.7558 and longitude 37.6173.",
      "Find the place name at lat 52.5200 and lon 13.4050.",
      "Show the address for coordinates latitude 41.9028 and longitude 12.4964.",
      "Look up the address for lat 19.4326 and lon -99.1332.",
      "Provide the address from latitude 39.9042 and longitude 116.4074.",
      "What is located at latitude 1.3521 and longitude 103.8198?",
      "Find the address for coordinates lat 45.4642 and lon 9.1900.",
      "Can you find the location at lat 34.0522 and lon -118.2437?",
      "Give me the full address for the GPS coordinates 51.5074 latitude and -0.1278 longitude.",
      "Retrieve the address corresponding to lat 48.8566 and lng 2.3522.",
      "What place is located at latitude 35.6895 and longitude 139.6917?",
      "Find the address for lat 55.7558 and lon 37.6173.",
      "Get the location details for coordinates lat 37.7749 and lng -122.4194.",
      "Return the address for latitude 41.9028 and longitude 12.4964.",
      "Locate the address for the GPS coordinates lat 52.5200 and lon 13.4050.",
      "Provide the address found at latitude 19.4326 and longitude -99.1332.",
      "What is the place name at lat 1.3521 and lon 103.8198?",
      "Find the full address for latitude 39.9042 and longitude 116.4074.",
      "Get the address for GPS coordinates lat -33.8688 and lon 151.2093.",
      "Can you find the location for the coordinates lat 34.0522 and lon -118.2437?",
      "Get the full address for latitude 51.5074 and longitude -0.1278.",
      "Please provide the address corresponding to lat 48.8566 and lng 2.3522.",
      "Find the place name at coordinates latitude 35.6895 and longitude 139.6917.",
      "What address is located at lat 55.7558 and lon 37.6173?",
      "Retrieve the address for latitude 37.7749 and longitude -122.4194.",
      "Show me the address for coordinates lat 52.5200 and lng 13.4050.",
      "Find the nearest address for latitude 41.9028 and longitude 12.4964.",
      "What is the location at lat 19.4326 and lon -99.1332?",
      "Get address details for latitude 39.9042 and longitude 116.4074.",
      "Provide the address for lat 1.3521 and lon 103.8198.",
      "Lookup the address at latitude 43.6532 and longitude -79.3832.",
      "Can you find the full address at latitude 34.0522 and longitude -118.2437?",
      "Give me the street address corresponding to lat 51.5074 and lon -0.1278.",
      "Provide the location details for latitude 48.8566 and longitude 2.3522.",
      "What location is at lat 35.6895 and lon 139.6917?",
      "Find the address for GPS coordinates 37.7749 latitude and -122.4194 longitude.",
      "Get the textual address for latitude 55.7558 and longitude 37.6173.",
      "Retrieve the address from coordinates lat 52.5200 and lon 13.4050.",
      "Tell me the address at latitude -33.8688 and longitude 151.2093.",
      "What is the place name for lat 41.9028 and lon 12.4964?",
      "Can you reverse geocode the coordinates 19.4326 latitude and -99.1332 longitude?",
      "Find the address at lat 59.3293 and lon 18.0686.",
      "Get the full address for latitude 43.6532 and longitude -79.3832.",
      "What is the address located at latitude 40.7128 and longitude -74.0060?",
      "Can you find the address for the coordinates lat=34.0522 and lon=-118.2437?",
      "Give me the full address for the GPS coordinates latitude 51.5074 and longitude -0.1278.",
      "Retrieve the address at lat 48.8566 and lng 2.3522.",
      "Find the location address for coordinates lat=35.6895 and lon=139.6917.",
      "Get the address corresponding to latitude 55.7558 and longitude 37.6173.",
      "What is the place at lat: 37.7749 and long: -122.4194?",
      "Provide the text address for the coordinates latitude 52.52 and longitude 13.405.",
      "Can you reverse geocode the position at lat=19.4326 and lng=-99.1332?",
      "Find the address for latitude 41.9028 and longitude 12.4964.",
      "Return the full address for the coordinates lat 59.3293 and lon 18.0686.",
      "Get location details from latitude 43.6532 and longitude -79.3832.",
      "What address corresponds to latitude 31.2304 and longitude 121.4737?",
      "Retrieve the full address at latitude 51.5074 and longitude -0.1278.",
      "Find the nearest address for latitude 35.6895 and longitude 139.6917.",
      "What location is at lat 55.7558 and lon 37.6173?",
      "Get the street address for the coordinates latitude 37.7749 and longitude -122.4194.",
      "Lookup the address at lat 52.52 and lng 13.405.",
      "Provide the address for coordinates latitude 41.9028 and longitude 12.4964.",
      "Find the place name for lat 19.4326 and lon -99.1332.",
      "Can you reverse geocode coordinates 39.9042 latitude and 116.4074 longitude to get the address?",
      "What is the full textual address for lat 43.6532 and lng -79.3832?",
      "Get the detailed address from coordinates latitude 28.6139 and longitude 77.2090.",
      "Can you find the location details at lat 51.5074 and lon -0.1278?",
      "Retrieve the full address from the coordinates lat=34.0522 and lng=-118.2437.",
      "Get the text address for latitude 48.8566 and longitude 2.3522.",
      "Find the place name or address at coordinates lat: 35.6895 and lon: 139.6917."
    ]
  },
  {
    "cluster_id": 3,
    "queries": [
      "Get the latest news headlines for Japan.",
      "Get the latest news headlines for Brazil.",
      "Get the latest news headlines for Germany.",
      "Get the latest news headlines for South Africa.",
      "Get the latest news headlines for Australia.",
      "Get the latest news headlines for Canada.",
      "Get the latest news headlines for Italy.",
      "Get the latest news headlines for Mexico.",
      "Get the latest news headlines for Sweden.",
      "Get the latest news headlines for India.",
      "Fetch the top technology stories in Germany.",
      "Fetch the top environmental stories in Brazil.",
      "Fetch the top healthcare stories in Japan.",
      "Fetch the top sports stories in Australia.",
      "Fetch the top economic stories in India.",
      "Fetch the top political stories in Canada.",
      "Fetch the top entertainment stories in South Korea.",
      "Fetch the top scientific stories in Sweden.",
      "Fetch the top education stories in France.",
      "Fetch the top travel stories in Italy.",
      "Show me current climate change news in Germany.",
      "Show me current artificial intelligence news in Japan.",
      "Show me current space exploration news in Brazil.",
      "Show me current cryptocurrency news in South Korea.",
      "Show me current renewable energy news in Canada.",
      "Show me current electric vehicle news in Australia.",
      "Show me current biotechnology news in Sweden.",
      "Show me current cybersecurity news in India.",
      "Show me current quantum computing news in the United Kingdom.",
      "Show me current health care news in France.",
      "Retrieve top headlines about renewable energy in Germany.",
      "Retrieve top headlines about artificial intelligence in Japan.",
      "Retrieve top headlines about space exploration in Canada.",
      "Retrieve top headlines about sustainable agriculture in Brazil.",
      "Retrieve top headlines about cybersecurity in Australia.",
      "Retrieve top headlines about electric vehicles in Norway.",
      "Retrieve top headlines about climate change policy in the United Kingdom.",
      "Retrieve top headlines about biotechnology advancements in South Korea.",
      "Retrieve top headlines about quantum computing in the United States.",
      "Retrieve top headlines about urban transportation innovation in the Netherlands.",
      "Find the most recent technology news articles in Germany.",
      "Find the most recent health news articles in Brazil.",
      "Find the most recent environmental news articles in Australia.",
      "Find the most recent financial news articles in Japan.",
      "Find the most recent political news articles in Canada.",
      "Find the most recent sports news articles in South Africa.",
      "Find the most recent entertainment news articles in Italy.",
      "Find the most recent scientific news articles in Sweden.",
      "Find the most recent educational news articles in India.",
      "Find the most recent cultural news articles in Mexico.",
      "Get breaking news in Japan.",
      "Get breaking news in Brazil.",
      "Get breaking news in South Africa.",
      "Get breaking news in Australia.",
      "Get breaking news in Germany.",
      "Get breaking news in Canada.",
      "Get breaking news in Argentina.",
      "Get breaking news in India.",
      "Get breaking news in Egypt.",
      "Get breaking news in Sweden.",
      "Fetch the latest technology headlines for Germany.",
      "Fetch the latest health headlines for Brazil.",
      "Fetch the latest entertainment headlines for Japan.",
      "Fetch the latest sports headlines for Australia.",
      "Fetch the latest business headlines for Canada.",
      "Fetch the latest science headlines for South Africa.",
      "Fetch the latest environment headlines for New Zealand.",
      "Fetch the latest politics headlines for India.",
      "Fetch the latest education headlines for United Kingdom.",
      "Fetch the latest travel headlines for Italy.",
      "Show top news in Germany.",
      "Show top news in Brazil.",
      "Show top news in Japan.",
      "Show top news in South Africa.",
      "Show top news in Canada.",
      "Show top news in Australia.",
      "Show top news in India.",
      "Show top news in Mexico.",
      "Show top news in Sweden.",
      "Show top news in New Zealand.",
      "Retrieve recent articles relating to climate change for Germany.",
      "Retrieve recent articles relating to renewable energy for Brazil.",
      "Retrieve recent articles relating to artificial intelligence for Japan.",
      "Retrieve recent articles relating to cryptocurrency regulation for South Korea.",
      "Retrieve recent articles relating to space exploration for Canada.",
      "Retrieve recent articles relating to electric vehicle adoption for Norway.",
      "Retrieve recent articles relating to quantum computing for Australia.",
      "Retrieve recent articles relating to cybersecurity threats for the United States.",
      "Retrieve recent articles relating to sustainable agriculture for Kenya.",
      "Retrieve recent articles relating to biotechnology advances for Switzerland.",
      "Get current headlines in the technology category for Germany.",
      "Get current headlines in the health category for Australia.",
      "Get current headlines in the entertainment category for Brazil.",
      "Get current headlines in the science category for Japan.",
      "Get current headlines in the business category for Canada.",
      "Get current headlines in the sports category for Spain.",
      "Get current headlines in the environment category for South Africa.",
      "Get current headlines in the travel category for Italy.",
      "Get current headlines in the education category for India.",
      "Get current headlines in the politics category for the United Kingdom."
    ]
  },
  {
    "cluster_id": 4,
    "queries": [
      "What is the geolocation of IP address 192.168.1.1?",
      "What is the geolocation of IP address 203.0.113.45?",
      "What is the geolocation of IP address 85.214.132.117?",
      "What is the geolocation of IP address 172.217.10.14?",
      "What is the geolocation of IP address 98.138.219.231?",
      "What is the geolocation of IP address 66.249.66.1?",
      "What is the geolocation of IP address 143.110.134.67?",
      "What is the geolocation of IP address 150.230.56.89?",
      "What is the geolocation of IP address 45.79.23.101?",
      "What is the geolocation of IP address 203.119.45.78?",
      "Fetch the coordinate information for 192.168.1.1.",
      "Fetch the coordinate information for 8.8.8.8.",
      "Fetch the coordinate information for 203.0.113.45.",
      "Fetch the coordinate information for 172.217.10.14.",
      "Fetch the coordinate information for 54.243.123.67.",
      "Fetch the coordinate information for 45.79.120.32.",
      "Fetch the coordinate information for 198.51.100.22.",
      "Fetch the coordinate information for 151.101.1.69.",
      "Fetch the coordinate information for 139.130.4.5.",
      "Fetch the coordinate information for 66.249.66.1.",
      "Retrieve the latitude and longitude for IP 192.168.1.1.",
      "Retrieve the latitude and longitude for IP 203.0.113.45.",
      "Retrieve the latitude and longitude for IP 8.8.8.8.",
      "Retrieve the latitude and longitude for IP 172.217.14.238.",
      "Retrieve the latitude and longitude for IP 54.239.28.85.",
      "Retrieve the latitude and longitude for IP 198.51.100.22.",
      "Retrieve the latitude and longitude for IP 145.97.39.155.",
      "Retrieve the latitude and longitude for IP 67.215.65.132.",
      "Retrieve the latitude and longitude for IP 91.198.174.192.",
      "Retrieve the latitude and longitude for IP 156.154.70.1.",
      "Get the coordinate data associated with 192.168.1.1.",
      "Get the coordinate data associated with 203.0.113.45.",
      "Get the coordinate data associated with 172.217.14.206.",
      "Get the coordinate data associated with 8.8.8.8.",
      "Get the coordinate data associated with 54.239.28.85.",
      "Get the coordinate data associated with 104.244.42.65.",
      "Get the coordinate data associated with 185.199.108.153.",
      "Get the coordinate data associated with 66.249.66.1.",
      "Get the coordinate data associated with 151.101.65.121.",
      "Get the coordinate data associated with 45.79.1.23.",
      "Look up the geolocation details for 192.168.1.1.",
      "Look up the geolocation details for 203.0.113.45.",
      "Look up the geolocation details for 172.217.16.142.",
      "Look up the geolocation details for 85.214.132.117.",
      "Look up the geolocation details for 54.239.28.85.",
      "Look up the geolocation details for 104.244.42.65.",
      "Look up the geolocation details for 199.195.250.93.",
      "Look up the geolocation details for 143.110.185.52.",
      "Look up the geolocation details for 66.249.66.1.",
      "Look up the geolocation details for 8.8.8.8.",
      "Show detailed location info (lat, long) for IP 192.168.1.1.",
      "Show detailed location info (lat, long) for IP 203.0.113.45.",
      "Show detailed location info (lat, long) for IP 8.8.8.8.",
      "Show detailed location info (lat, long) for IP 172.217.14.238.",
      "Show detailed location info (lat, long) for IP 54.85.132.22.",
      "Show detailed location info (lat, long) for IP 45.33.32.156.",
      "Show detailed location info (lat, long) for IP 151.101.1.69.",
      "Show detailed location info (lat, long) for IP 66.249.66.1.",
      "Show detailed location info (lat, long) for IP 138.197.64.45.",
      "Show detailed location info (lat, long) for IP 89.160.20.112.",
      "Find the geographic coordinates of IP address 192.168.1.1.",
      "Find the geographic coordinates of IP address 203.0.113.45.",
      "Find the geographic coordinates of IP address 8.8.8.8.",
      "Find the geographic coordinates of IP address 172.217.10.14.",
      "Find the geographic coordinates of IP address 45.79.120.22.",
      "Find the geographic coordinates of IP address 139.130.4.5.",
      "Find the geographic coordinates of IP address 151.101.1.69.",
      "Find the geographic coordinates of IP address 66.249.66.1.",
      "Find the geographic coordinates of IP address 54.239.28.85.",
      "Find the geographic coordinates of IP address 104.244.42.1.",
      "What's the geolocation for IP 192.168.1.1?",
      "What's the geolocation for IP 203.0.113.45?",
      "What's the geolocation for IP 8.8.8.8?",
      "What's the geolocation for IP 172.217.16.142?",
      "What's the geolocation for IP 45.79.23.12?",
      "What's the geolocation for IP 54.239.28.85?",
      "What's the geolocation for IP 149.56.112.78?",
      "What's the geolocation for IP 67.215.65.132?",
      "What's the geolocation for IP 98.137.246.8?",
      "What's the geolocation for IP 203.208.60.1?",
      "Retrieve full geolocation for IP 192.168.1.1.",
      "Retrieve full geolocation for IP 8.8.8.8.",
      "Retrieve full geolocation for IP 203.0.113.45.",
      "Retrieve full geolocation for IP 172.217.16.142.",
      "Retrieve full geolocation for IP 54.239.28.85.",
      "Retrieve full geolocation for IP 145.87.23.109.",
      "Retrieve full geolocation for IP 198.51.100.27.",
      "Retrieve full geolocation for IP 65.52.108.23.",
      "Retrieve full geolocation for IP 23.45.67.89.",
      "Retrieve full geolocation for IP 91.198.174.192.",
      "Provide the location details for IP address 192.168.1.1.",
      "Provide the location details for IP address 203.0.113.45.",
      "Provide the location details for IP address 8.8.8.8.",
      "Provide the location details for IP address 172.217.16.195.",
      "Provide the location details for IP address 54.239.28.85.",
      "Provide the location details for IP address 151.101.1.69.",
      "Provide the location details for IP address 185.60.216.35.",
      "Provide the location details for IP address 45.79.23.12.",
      "Provide the location details for IP address 66.249.66.1.",
      "Provide the location details for IP address 104.244.42.65."
    ]
  },
  {
    "cluster_id": 5,
    "queries": [
      "Can you provide the WHOIS information for the domain example.com?",
      "I need to look up the domain registration details for openai.com.",
      "Please retrieve the WHOIS record for github.com.",
      "Get the domain info for wikipedia.org including registrar and expiration date.",
      "Show me the WHOIS lookup data for cnn.com.",
      "Fetch the registration details of microsoft.com from the WHOIS database.",
      "Provide the WHOIS information for the domain stackoverflow.com.",
      "Look up the domain registration info for apple.com.",
      "Retrieve the WHOIS data for amazon.com.",
      "Get detailed WHOIS information for the domain twitter.com.",
      "Can you find the WHOIS record for linkedin.com?",
      "Check the domain info for netflix.com and provide registrar and name servers.",
      "Please provide WHOIS details for the domain yahoo.com.",
      "I need to find the registration details for openai.com.",
      "Please look up the WHOIS data for github.com.",
      "Retrieve the domain ownership information for wikipedia.org.",
      "What are the registrar details for microsoft.com?",
      "Show me the WHOIS record for techcrunch.com.",
      "Check the contact information for the domain cnn.com.",
      "Get the expiration date and name servers for amazon.com.",
      "Find the WHOIS info for stackoverflow.com.",
      "Lookup the domain registration details for nytimes.com.",
      "Can you fetch the WHOIS data for spotify.com?",
      "Provide the domain info and registration data for linkedin.com.",
      "Please get me the WHOIS records for facebook.com.",
      "I need to look up the registration details for openai.com using WHOIS.",
      "Please retrieve the WHOIS data for github.com.",
      "Show me the WHOIS record for microsoft.com.",
      "Get the domain registration information for wikipedia.org.",
      "Can you find the WHOIS details for stackoverflow.com?",
      "Look up the WHOIS info for amazon.com.",
      "I want to see the WHOIS data for twitter.com.",
      "Provide the WHOIS lookup results for cnn.com.",
      "Retrieve the domain WHOIS information for nytimes.com.",
      "Check the WHOIS details for linkedin.com.",
      "Please get the WHOIS record for reddit.com.",
      "Find the WHOIS registration info for apple.com.",
      "I need to get the registration details for the domain openai.com.",
      "Please look up the WHOIS data for the domain github.com.",
      "Retrieve the domain ownership and registrar info for microsoft.com.",
      "Show me the WHOIS record for the domain cnn.com.",
      "What are the WHOIS details for the domain wikipedia.org?",
      "Get the domain registration and expiration date information for ford.com.",
      "Fetch the WHOIS data for the domain tesla.com including contact info.",
      "Provide the WHOIS lookup results for the domain adobe.com.",
      "Look up the domain whois record for nytimes.com.",
      "I want to see the WHOIS information for the domain stackoverflow.com.",
      "Can you retrieve the registrar and name server details for the domain paypal.com?",
      "Please get the WHOIS details for the domain spotify.com.",
      "Please retrieve the WHOIS data for the domain github.com.",
      "Get the WHOIS record for the domain microsoft.com.",
      "Show me the domain registration info for wikipedia.org.",
      "Fetch the WHOIS information for the domain cnn.com.",
      "Lookup the WHOIS data for the domain stackoverflow.com.",
      "Provide the WHOIS details for the domain amazon.com.",
      "Retrieve the WHOIS records for the domain reddit.com.",
      "Can you find the WHOIS information for the domain nytimes.com?",
      "Get the domain registration information for example.org.",
      "Please fetch the WHOIS data for the domain spotify.com.",
      "Look up the WHOIS details for the domain tesla.com.",
      "I need to look up registration details for the domain openai.com.",
      "Please fetch the WHOIS data for the domain google.com.",
      "Show me the domain registry information for microsoft.com.",
      "Retrieve the WHOIS record for the domain wikipedia.org.",
      "Get the domain ownership details for the domain github.com.",
      "Find out the registrar and expiration date for the domain netflix.com.",
      "Look up the WHOIS info for the domain stackoverflow.com.",
      "Provide the contact information and name servers for the domain twitter.com.",
      "Check the WHOIS details for the domain airbnb.com.",
      "Can you get the domain registration data for the domain linkedin.com?",
      "Show the full WHOIS record for the domain reddit.com.",
      "Retrieve registry and administrative information for the domain amazon.com.",
      "Show me the WHOIS data for google.com.",
      "Retrieve the domain owner information for microsoft.com.",
      "Get the expiration date and registrar of wikipedia.org.",
      "Look up the contact details for the domain github.com.",
      "Provide the WHOIS record for amazon.co.uk.",
      "Fetch the name servers and registration info for stackoverflow.com.",
      "Find the domain creation date for twitter.com.",
      "Can you get the WHOIS details for the domain netflix.com?",
      "Show the registration information for linkedin.com.",
      "Retrieve the WHOIS data including registrar and contact info for adobe.com.",
      "Get full WHOIS information for wordpress.org.",
      "I need to find the registrar and contact details for openai.com.",
      "Please retrieve the WHOIS details for github.com.",
      "Get the domain registration data for cnn.com, including expiration date and name servers.",
      "Lookup the WHOIS information for microsoft.com.",
      "Find out who owns the domain example.org and its registration details.",
      "Show me the WHOIS record for stackoverflow.com.",
      "Provide the domain info and registration data for wikipedia.org.",
      "Can you fetch the WHOIS data for amazon.com?",
      "Retrieve detailed WHOIS info for apple.com.",
      "Get the registration and contact info for twitter.com.",
      "Look up the WHOIS domain details for linkedin.com.",
      "Please obtain the WHOIS information for netflix.com.",
      "Can you provide the WHOIS details for the domain example.com?",
      "I need to look up registration information for the domain openai.com.",
      "Get me the domain registration info for stackoverflow.com.",
      "Show the WHOIS records for the domain wikipedia.org.",
      "Fetch the domain owner and registrar details for cnn.com."
    ]
  },
  {
    "cluster_id": 6,
    "queries": [
      "Can you validate the email address john.doe@example.com for me?",
      "Please check if jane_smith123@subdomain.mailservice.net is a valid email.",
      "Verify the email address contact@mycompany.co.uk.",
      "Is the email address test.user+label@gmail.com properly formatted and real?",
      "Validate support@internationalized-domain.com to ensure it's correct.",
      "Check if the email address info@website-with-dash.org is valid and not misspelled.",
      "Could you verify the email admin123@domain123.com for syntax errors?",
      "Please validate the email address user.name@domain.subdomain.com for correctness.",
      "Is the email address invalid-email@domain,com valid or malformed?",
      "Check the email address first.last@companymail.io to confirm it is real.",
      "Verify if test_email@new-domain123.net is a valid.",
      "Validate the email address example.user@xn--fiq228c.com.",
      "Please check if hello.world@startup-company.us is a valid email address for sending.",
      "Please check if jane_smith123@domain.co.uk is a valid email address.",
      "Is the email address info@invalid-domain.xyz valid?",
      "Verify the email address support@mywebsite.com to see if it is real and active.",
      "I need to validate the email user+test@gmail.com to ensure it’s correctly formatted.",
      "Can you confirm if contact@bücher.de is a valid and reachable email?",
      "Check if the email address admin@company123.org is properly formatted and exists.",
      "Please verify the email address hello.world@international-domain.net for syntax errors.",
      "Is the email address sales_team@business-email.com valid and not misspelled?",
      "Validate the email mike.o'reilly@example-email.com to make sure it’s correct.",
      "Can you check if service@sub.domain-example.com is a valid email address?",
      "Please verify the email address test.email+filter@domain.io to confirm it's valid.",
      "Check the email address no-reply@website.co for proper formatting and validity.",
      "Please check if the email jane.smith@domain.co.uk is valid.",
      "I need to verify the email address contact@mywebsite.org to ensure it's real.",
      "Is the email address user123@gmail.com correctly formatted and active?",
      "Validate the email address support@international-domain.com, including its syntax.",
      "Check if the email address example.user+test@sub.domain.com is valid.",
      "Please verify the email address info@company-email.net for any misspellings or errors.",
      "Can you confirm whether the email address sales.department@business.io is valid and reachable?",
      "Verify the email hello.world@gmail.com for proper format.",
      "Check the validity and syntax of the email address first.last@new-domain.org.",
      "Please validate the email address admin@startup.co for any malformed parts.",
      "Is the email address marketing.team@enterprise.com a valid address?",
      "Can you verify if the email address contact_us@service-provider.com is properly formatted and active?",
      "Can you validate the email address john.doe@example.com to check if it's valid?",
      "Please verify if jane.smith@international-domain.co.uk is a valid and correctly formatted email.",
      "Check the email address support@mybusiness.com for syntax errors.",
      "Is the email contact@startup.io a real and valid email address?",
      "Validate the email address user+tag@gmail.com to ensure it can receive emails.",
      "Can you confirm if info@company-name.com is a properly formatted and valid email?",
      "Please verify the email address maria.fernandez@correo.es for correctness and real existence.",
      "Check whether the email test.user@subdomain.example.org is valid and can receive messages.",
      "Validate the email address admin@mywebsite.net to avoid sending emails to invalid addresses.",
      "Can you verify if the email address first.last@domain-with-dash.com is real and properly formatted?",
      "Please check if the email address example.user@xn--d1acufc.xn-.com is valid.",
      "Validate the email address hello.world+promo@gmail.com to ensure it's valid and correctly formatted.",
      "Check the email address invalid-email@@example.com to identify any syntax or formatting issues.",
      "Validate the email address john.doe@example.com to ensure it is correctly formatted and valid.",
      "Check if the email jane_smith123@domain.co.uk is valid and can receive emails.",
      "Verify the email address customer.support@international-domain.org for syntax errors.",
      "Validate the email contact@mybusiness.com to confirm it is not misspelled or malformed.",
      "Check if the email address marketing.team+newsletter@company-mail.com is a real and active email.",
      "Verify whether the email info@subdomain.example.net is properly formatted and reachable.",
      "Validate the email address user.name+tag+sorting@example-email.com to ensure it is valid.",
      "Check the email address client-service@new-domain123.io for validity.",
      "Verify the email test.email@xn--d1acpjx3f.xn--p1ai.com",
      "Validate the email address sales.department@business.co to detect any syntax mistakes.",
      "Check if the email address admin@localhost is valid and usable for sending emails.",
      "Verify the email employee.email@companyname.us to confirm it is a real.",
      "Validate the email address feedback@website-example.org for correctness and ability to receive emails.",
      "Can you validate the email address john.doe@example.com to make sure it's correct?",
      "Please check if the email jane.smith@international-domain.com is valid and properly formatted.",
      "Verify the email contact@mybusiness.org to ensure it is a real and active email address.",
      "Can you confirm whether test.user+label@gmail.com is a valid email address?",
      "Validate the email address info@subdomain.example.co.uk for syntax.",
      "Check if support@nonexistentdomain.xyz is a valid email or if it might be misspelled.",
      "Please verify the email address María.Núñez@correo.es to see if it valid.",
      "Is the email address user.name@invalid-domain invalid or just malformed?",
      "Can you validate the email address marketing@company.com for correctness?",
      "Check if contact_us@service-provider.net is a valid email to avoid sending bounce backs.",
      "Verify the email address first.last@domain-with-dash.com for proper syntax and active status.",
      "Please confirm that the email address hello.world+tag@gmail.com is valid.",
      "Validate the email address example@localhost to see if it is considered malformed or invalid.",
      "Please check if the email jane_smith123@mail.example.org is valid.",
      "Verify whether the email contact@international-domain.com is correctly formatted and active.",
      "I need to confirm if support@mycompany.co.uk is a real and reachable email address.",
      "Could you validate the email address user+test@gmail.com and ensure it's not malformed?",
      "Check if this email is valid: marketing.team@business-example.com.",
      "Is the email address fake.email@nonexistentdomain.xyz a valid?",
      "Please verify the email address first.last@subdomain.example.com for syntax.",
      "Can you validate multiple emails starting with alice.wonderland@example.com individually?",
      "I want to make sure that no_reply@service-provider.io is a valid email address before sending.",
      "Check if info@xn--fsq.com is a valid and active email.",
      "Please verify the email address sales@example-company.net and return any error messages.",
      "Validate whether the email address test.user+filter@mail-service.org is syntactically correct.",
      "Can you validate the email address john.doe@example.com to ensure it is valid?",
      "Please verify if the email jane_smith123@gmail.com is a valid and real email address.",
      "Check the syntax of the email contact@mycompany.co.uk.",
      "Validate the email address test.user+alias@international-domain.com to confirm it is correct and active.",
      "Is the email address wrong.email@exmple.com spelled correctly and able to receive emails?",
      "Can you confirm if support@service.io is a properly formatted and valid email?",
      "Please validate this email 'alice.bob@example.org'",
      "Check if the email marketing@startup.io is valid and will not bounce.",
      "Verify the email address first.last@domain-with-dash.com for correctness.",
      "Can you validate the email contact_us@company123.biz to ensure it is active?",
      "Please check if hello.world@subdomain.example.com is a valid email address and ready to receive emails.",
      "Is the email address user+filter@webmail.com correctly formatted?"
    ]
  },
  {
    "cluster_id": 7,
    "queries": [
      "Analyze the sentiment of the text: 'I love the new design of your website, it's very user-friendly!'",
      "Please determine the sentiment for this review: 'The product quality is terrible and I want a refund.'",
      "What is the sentiment of this sentence: 'Today is a beautiful day and I feel great.'",
      "Can you analyze the sentiment of this paragraph: 'Customer service was helpful but the delivery was delayed.'",
      "Find the sentiment for this feedback: 'The movie was okay, not the best but not the worst either.'",
      "Analyze the sentiment of this Spanish text: 'Estoy muy feliz con los resultados del proyecto.'",
      "Detect the sentiment in this French sentence: 'Le restaurant avait une ambiance agréable mais la nourriture était moyenne.'",
      "Evaluate the sentiment for this tweet: 'Just got my new phone and it works perfectly!'",
      "Determine the sentiment of the following text: 'I'm disappointed with the recent update; it broke many features.'",
      "Analyze the sentiment in this short story excerpt: 'Despite the challenges, she remained hopeful and optimistic.'",
      "Please provide the sentiment for this customer comment: 'The app crashes frequently, which is frustrating.'",
      "What is the sentiment analysis for this text: 'The book was captivating and well-written.'",
      "Analyze the sentiment of this German sentence: 'Das Wetter heute ist schrecklich, ich bleibe zu Hause.'",
      "Analyze the sentiment of the text: 'I love the new design of your website, it is very user-friendly and visually appealing.'",
      "Please determine the sentiment of this sentence: 'The movie was boring and too long for my taste.'",
      "What is the sentiment of the following review? 'Customer service was excellent and resolved my issue quickly.'",
      "Can you analyze the sentiment of this text: 'The food at the restaurant was just okay, nothing special.'",
      "Evaluate the sentiment for this statement: 'I am extremely happy with the performance of my new laptop.'",
      "Determine the sentiment in this paragraph: 'The weather today is gloomy and makes me feel a bit down.'",
      "Please provide a sentiment for the text: 'Their latest product launch exceeded all my expectations.'",
      "Analyze the sentiment of this feedback: 'The app crashes frequently and is very frustrating to use.'",
      "What is the sentiment behind this comment? 'The book had some interesting parts but overall was disappointing.'",
      "Can you find the sentiment in this tweet? 'Just got promoted at work! Feeling fantastic and grateful.'",
      "Please analyze the sentiment of this message: 'The hotel room was dirty and the staff were unhelpful.'",
      "Determine the sentiment of the text: 'The concert was amazing, the band played all my favorite songs.'",
      "Evaluate the sentiment for this statement: 'I have no strong feelings about the new policy changes.'",
      "Analyze the sentiment of the text: 'I had a wonderful day at the beach with my family.'",
      "What is the sentiment of this text: 'The movie was boring and too long.'",
      "Determine the sentiment of this review: 'Excellent customer service and fast delivery!'",
      "Please analyze the sentiment of the following sentence: 'I am not happy with the product quality.'",
      "Can you find the sentiment in this text: 'The food was okay, nothing special but not bad either.'",
      "Evaluate the sentiment for this text: 'Fantastic experience, will definitely come back again.'",
      "What sentiment does this text convey: 'The app crashes frequently and is frustrating to use.'",
      "Analyze the sentiment of this Spanish text: 'Me encanta este lugar, la atmósfera es genial.'",
      "Please provide the sentiment analysis for this text: 'The service was slow but the staff was friendly.'",
      "Determine the sentiment of the text: 'Terrible experience, I want a refund immediately.'",
      "Find the sentiment expressed in this sentence: 'I feel neutral about the new policy changes.'",
      "What is the sentiment of this German text: 'Das Produkt ist gut, aber der Versand war langsam.'",
      "Analyze the sentiment of this French text: 'Le concert était incroyable et très émouvant.'",
      "Analyze the sentiment of the text: 'I had a wonderful day at the park with my family.'",
      "What is the sentiment of the following text? 'The new movie was disappointing and too long.'",
      "Please determine the sentiment for this text: 'Estoy muy feliz con los resultados de mi examen.'",
      "Can you analyze the sentiment of this review? 'The product works well, but the delivery was late.'",
      "Find the overall sentiment of this message: 'I am not sure if I like the new update on the app.'",
      "Analyze the sentiment of the text: 'Je suis très content de la qualité du service reçu.'",
      "Please provide the sentiment for this statement: 'The weather today is gloomy and makes me feel sad.'",
      "What sentiment does this text convey? 'Das Essen im Restaurant war hervorragend und der Service freundlich.'",
      "Analyze the sentiment of this text: 'The customer support was helpful, but the response time was slow.'",
      "Determine the sentiment of the following sentence: 'I absolutely love the new features in the software update.'",
      "Can you analyze the sentiment for this short text? 'The book was okay, not the best I've read.'",
      "Find the sentiment for this Spanish sentence: 'No me gustó la experiencia en el hotel, fue muy mala.'",
      "Analyze the sentiment of this text: 'The conference was informative and engaging throughout the sessions.'",
      "Analyze the sentiment of the following text: 'I absolutely love the new design of your website!'",
      "What is the sentiment of this review? 'The product quality is terrible and I am very disappointed.'",
      "Please determine the sentiment of this message: 'The movie was okay, not great but not bad either.'",
      "Can you analyze the sentiment of this tweet? 'Just got my package early, so happy with the service!'",
      "Evaluate the sentiment of this customer feedback: 'Customer support was helpful but the wait time was too long.'",
      "Find the sentiment for this text: 'The weather today is gloomy and makes me feel sad.'",
      "Analyze the following statement for sentiment: 'I am excited about the upcoming vacation next month.'",
      "What sentiment does this blog comment convey? 'This article provides some useful insights and clear explanations.'",
      "Please provide the sentiment analysis for this phrase: 'I have mixed feelings about the new policy changes.'",
      "Determine the sentiment of this product description: 'This smartphone has excellent battery life and a sleek design.'",
      "Analyze the sentiment of the text: 'The concert was disappointing due to poor sound quality.'",
      "Can you detect the sentiment in this sentence? 'The team performed well and exceeded expectations.'",
      "Find the sentiment for this short review: 'Not bad, but could be improved in many areas.'",
      "Analyze the sentiment of the text: 'I love the new design of your website, it's very user-friendly and visually appealing.'",
      "Can you determine the sentiment of this review? 'The product quality was disappointing and did not meet my expectations.'",
      "Please analyze the sentiment for this tweet: 'Just had the best coffee at the new cafe downtown, highly recommend it!'",
      "What is the sentiment of the following customer feedback? 'Customer service was okay, but the delivery was late.'",
      "Detect the sentiment in this paragraph: 'The movie had stunning visuals but the storyline was quite predictable and dull.'",
      "Evaluate the sentiment of this text: 'Estoy muy satisfecho con el servicio recibido, fue excelente.'",
      "Analyze the sentiment of this comment: 'The book was boring and I struggled to finish it.'",
      "Please provide the sentiment analysis for this message: 'Had a wonderful time at the concert, the band was amazing!'",
      "Determine the sentiment for this statement: 'The app keeps crashing and is very frustrating to use.'",
      "What sentiment do you detect in this sentence? 'The hotel was clean and the staff were friendly and helpful.'",
      "Analyze this text's sentiment: '我觉得这个产品非常实用，性价比很高。'",
      "Please analyze the sentiment of this feedback: 'The food was average, nothing special but not terrible either.'",
      "Can you provide a sentiment analysis for this review? 'The delivery was fast, but the packaging was damaged upon arrival.'",
      "Analyze the sentiment of the text: 'I had a wonderful experience at the new restaurant downtown.'",
      "What is the sentiment of this review? 'The movie was boring and too long.'",
      "Please determine the overall sentiment for the following text: 'I love how easy this product is to use!'",
      "Can you analyze the sentiment of this message? 'The service was okay, nothing special.'",
      "Evaluate the sentiment of this statement: 'I'm extremely disappointed with the customer support.'",
      "Find the sentiment for this feedback: 'The book was engaging and well-written.'",
      "What sentiment does this text express? 'Today was just an average day, nothing exciting happened.'",
      "Analyze the sentiment for the following comment: 'The new update improved the app significantly.'",
      "Please provide the sentiment analysis for this sentence: 'Traffic was terrible and made me late.'",
      "Determine the sentiment of the text: 'The hotel room was clean and comfortable.'",
      "Can you assess the sentiment of this phrase? 'I'm not happy with the delay in delivery.'",
      "Analyze this text's sentiment: 'The concert was fantastic, had a great time!'",
      "What is the sentiment of this review? 'The product quality is mediocre, but the price is fair.'",
      "Can you analyze the sentiment of the text: 'I had a wonderful experience at the restaurant last night!'?",
      "Please determine the sentiment of this review: 'The product quality was terrible and very disappointing.'",
      "What is the sentiment of the following sentence: 'Estoy muy contento con el servicio recibido.'?",
      "Analyze the sentiment of this text: 'The movie was okay, not great but not bad either.'",
      "Could you provide the sentiment analysis for the statement: 'I absolutely love the new design of your website.'?",
      "Please detect the sentiment in this paragraph: 'Despite the delays, the customer support was helpful and polite.'",
      "What sentiment does this text convey: 'Cette expérience a été frustrante et décevante.'?",
      "Analyze the sentiment of this review: 'The app crashes frequently and is very slow.'",
      "Can you identify the sentiment of the following comment: 'Great job on the presentation, it was very clear and engaging.'?"
    ]
  },
  {
    "cluster_id": 8,
    "queries": [
      "What language is the text 'Bonjour, comment allez-vous aujourd'hui ?' written in?",
      "Detect the language of this sentence: 'Hola, ¿cómo estás hoy?'",
      "Can you identify the language of the phrase 'Guten Tag, wie geht es Ihnen?'?",
      "Please tell me the language of the text '今日はお元気ですか？'",
      "What is the language of this text: 'Привет, как дела?'",
      "Identify the language of the sentence 'Ciao, come stai oggi?'",
      "Determine the language of this text: '안녕하세요, 오늘 기분이 어떠세요?'",
      "Find out the language of the phrase 'Olá, como você está hoje?'",
      "What language is used in the sentence 'Merhaba, bugün nasılsın?'?",
      "Detect the language of this text: 'שלום, מה שלומך היום?'",
      "Please identify the language of 'Hej, hur mår du idag?'",
      "Can you detect the language of 'Salve, quid agis hodie?'?",
      "What language is the text 'नमस्ते, आप कैसे हैं आज?' written in?",
      "What language is the text 'Bonjour tout le monde' written in?",
      "Detect the language of the sentence '今日はいい天気ですね'.",
      "Identify the language used in the text 'Hola, ¿cómo estás?'",
      "Determine the language of the phrase 'Das ist ein schöner Tag' from this input.",
      "Can you detect the language of the text 'Это тестовое предложение'?",
      "Find out the language of the message 'Ciao, come va?'",
      "What language is the following text: '안녕하세요, 오늘 기분이 어때요?'",
      "Please detect the language in this text: 'Olá, tudo bem?'",
      "Identify the language of the sentence 'Это пример текста на русском языке'.",
      "Detect the language of the phrase 'Saluton, kiel vi fartas?'",
      "What language is 'Merhaba, nasılsın?' written in?",
      "Determine the language of this text: 'Hej, hur mår du idag?'",
      "Can you identify the language of the text 'Γειά σου, πώς είσαι;'?",
      "Detect the language of the sentence 'Hello, how are you today?'",
      "Identify the language used in the text '¿Dónde está la biblioteca?'",
      "Can you tell me the language of this phrase: 'Guten Tag, wie geht es Ihnen?'",
      "Find out the language of the input '今日はいい天気ですね' please.",
      "Please detect the language of the text 'Привет, как дела?'",
      "What language is used in the sentence 'Ciao, come stai?'?",
      "Determine the language of the text '안녕하세요, 오늘 기분이 어때요?'",
      "Identify the language of 'Este es un texto de ejemplo' for me.",
      "Tell me the language of this text: 'Merhaba, nasılsın?'",
      "What language is the phrase 'Salve, quid agis?' written in?",
      "Detect the language of 'Olá, tudo bem com você?' in this text.",
      "Please identify the language used in the sentence 'Hej, hur mår du?'",
      "Can you identify the language for this text: '¿Dónde está la biblioteca?'",
      "Please tell me the language of the phrase 'Guten Morgen, wie geht es dir?'",
      "What language is used in the text '今日は元気ですか？'?",
      "Detect the language of this text: 'Ciao, come stai?'",
      "Identify the language of the sentence 'Привет, как дела?'",
      "What language is the following text: 'Estou aprendendo português'?",
      "Please detect the language of the text 'Je suis très heureux aujourd'hui'",
      "Can you find out the language of this text: 'Dit is een testzin in het Nederlands'?",
      "Detect the language used in the text 'Это пример текста на русском языке'",
      "What language is detected in the sentence 'אני לומד עברית'?",
      "Identify the language of this text: 'यह एक हिंदी वाक्य है'",
      "Detect the language of the sentence 'This is a sample English sentence.'",
      "Can you identify the language of the phrase '¿Dónde está la biblioteca?'?",
      "Determine the language used in the text '今日はとても暑いです。'",
      "Please detect the language of the input text: 'Das Wetter ist heute schön.'",
      "What language does the text 'Ciao, come stai?' belong to?",
      "Identify the language of the sentence 'Je suis très heureux de te voir.'",
      "Find out the language of the phrase 'Мне нравится читать книги.'",
      "Detect the language for the input text '안녕하세요, 만나서 반갑습니다.'",
      "What language is used in the sentence 'Olá, tudo bem com você?'",
      "Please detect which language the text 'Het is een mooie dag vandaag.' is written in.",
      "Can you tell me the language of 'مرحبا كيف حالك؟'?",
      "Determine the language of the text 'Привет, как дела?'",
      "What language is this text written in: 'Bonjour tout le monde'?",
      "Detect the language of the following sentence: 'Hola, ¿cómo estás?'",
      "Identify the language used in this phrase: 'Guten Tag, wie geht es Ihnen?'",
      "Can you tell me the language of this text: '今日はとてもいい天気です'?",
      "Please determine the language of this input: 'Ciao, come stai oggi?'",
      "Find out what language this sentence is in: 'Привет, как дела?'",
      "What language is detected in this text: 'Olá, tudo bem?'",
      "Detect the language of the phrase: '안녕하세요, 오늘 기분이 어때요?'",
      "Identify the language of this sentence: 'Salve, quid agis hodie?'",
      "Can you detect the language of this text: 'مرحبا كيف حالك؟'",
      "Please tell me the language of this input: 'Hej, hur mår du idag?'",
      "What is the language of this text: 'Hallo, wie geht’s dir heute?'",
      "Determine the language used in this phrase: 'नमस्ते, आप कैसे हैं?'",
      "Can you identify the language of this sentence: 'Hola, ¿cómo estás?'?",
      "Detect the language used in the text '今日は天気がいいです'.",
      "Please tell me the language of the phrase 'Das ist ein schöner Tag'.",
      "What language is the following text: 'Ciao, come stai?'?",
      "Identify the language of this text: 'Привет, как дела?'",
      "Can you determine the language of the sentence 'Este es un texto en español'?",
      "Detect the language of the text '안녕하세요, 반갑습니다'.",
      "What language is detected in the phrase 'Olá, tudo bem?'?",
      "Please identify the language of this text: 'Je suis content de te voir'.",
      "Detect the language of the sentence 'Это пример текста на русском языке'.",
      "What language is 'مرحبا كيف حالك' written in?",
      "Identify the language of the text 'This is an example of English text'.",
      "Detect the language of the following text: 'Hola, ¿cómo estás?'",
      "Identify the language used in this sentence: 'Das ist ein schöner Tag.'",
      "Can you tell me the language of this text: '今日は良い天気ですね'?",
      "Find out which language this is: 'Ciao, come stai?'",
      "Determine the language of the text: 'Привет, как дела?'",
      "Please detect the language of this string: 'Este es un texto de ejemplo.'",
      "What language is the phrase 'Je suis très heureux' in?",
      "Identify the language for this input: 'Dit is een testzin.'",
      "Detect the language of this text snippet: '안녕하세요, 반갑습니다.'",
      "What is the language of the following text: 'Olá, tudo bem?'",
      "Tell me the language used in this message: 'Это пример текста.'",
      "Determine the language of this phrase: 'Είναι μια όμορφη μέρα.'",
      "Can you detect the language of this text: \"Bonjour, comment allez-vous aujourd'hui?\"?",
      "Please identify the language used in the following sentence: \"Das ist ein schöner Tag für einen Spaziergang.\""
    ]
  },
  {
    "cluster_id": 9,
    "queries": [
      "Generate a QR code image for the URL https://example.com",
      "Create a QR code from the text 'Hello World'",
      "Get a downloadable QR code PNG for the URL https://openai.com",
      "Produce a QR code image for the string 'Contact: John Doe, +1234567890'",
      "Generate a QR code for the URL https://mywebsite.org/about",
      "Create a QR code image from the text 'Event: Conference 2024 on May 5th'",
      "Get a QR code for the URL https://shop.example.com/product/123",
      "Generate a QR code image for the string 'WiFi Password: MySecret123'",
      "Create a QR code for the URL https://docs.api.com/v1/reference",
      "Produce a QR code image from the text 'Location: 123 Main St, Springfield'",
      "Generate a QR code from the URL https://blog.example.net/article?id=456",
      "Create a QR code image for the string 'Promo Code: SAVE20'",
      "Get a QR code image for the URL https://example.com/signup",
      "Create a QR code from the text 'Hello World!'",
      "Can you produce a QR code image for the string 'OpenAI API documentation'?",
      "I need a QR code generated for the website https://openai.com",
      "Please generate a downloadable QR code for the URL https://github.com",
      "Make a QR code image from the text 'Scan me to visit example.com!'",
      "Generate a QR code for the string 'Contact: info@example.com'",
      "Create a QR code image for the URL https://news.ycombinator.com",
      "Convert the text 'Welcome to our event 2024' into a QR code",
      "Produce a QR code image for the link https://www.wikipedia.org",
      "Generate a QR code for the string 'Discount code: SAVE20'",
      "Create a QR code image for the URL https://www.twitter.com",
      "Make a QR code from the text 'Join our newsletter at subscribe@example.com'",
      "Create a QR code for the text 'Hello World!'",
      "Show me a QR code for the website https://openai.com",
      "I need a QR code image for the string 'Contact: John Doe, +1234567890'",
      "Make a QR code for the URL https://github.com",
      "Generate a downloadable QR code for the text 'Event: Meetup at 5 PM'",
      "Create a QR code image from the URL https://news.ycombinator.com",
      "Provide a QR code for the string 'WiFi Password: mysecretpassword123'",
      "Make a QR code for the URL https://weather.com/today",
      "Generate a QR code image for the text 'Scan to follow me on Instagram'",
      "Create a QR code for the URL https://linkedin.com/in/janedoe",
      "Produce a QR code image for the text 'Discount code: SAVE20'",
      "I want a QR code generated from the URL https://example.org/download",
      "Create a QR code from the text 'Welcome to OpenAI!'",
      "Produce a QR code for the URL https://openai.com/blog",
      "Generate a QR code image for the string 'Contact: info@example.com'",
      "Create a downloadable QR code for the URL https://github.com",
      "Make a QR code from the text 'Event Date: 2024-07-01'",
      "Generate a QR code image for the URL https://maps.google.com",
      "Create a QR code from the string 'Scan to join our newsletter'",
      "Produce a QR code image for the URL https://example.org/about",
      "Generate a QR code for the text 'Discount Code: SAVE20'",
      "Create a QR code image from the URL https://twitter.com/OpenAI",
      "Make a QR code for the string 'Hello, World!'",
      "Generate a QR code image for the URL https://linkedin.com/in/example",
      "Provide a downloadable QR code for the URL https://www.wikipedia.org",
      "Make a QR code image for the string 'Contact us at contact@example.com'",
      "Generate a QR code for the URL https://shop.example.com/products/123",
      "Create a QR code image from the text 'Event starts at 7 PM on July 10'",
      "Produce a QR code for the string 'https://github.com/openai'",
      "Generate a QR code image for the URL https://news.example.com/latest",
      "Create a QR code from the text 'Scan to join our newsletter'",
      "Make a QR code image for the URL https://example.com/download/app.apk",
      "Generate a QR code for the string 'Happy Birthday, John!'",
      "Provide a QR code image for the URL https://blog.example.com/post/456",
      "Create a QR code from the text 'Follow us on Twitter @example'",
      "Create a downloadable QR code for the text 'Hello World!'",
      "Produce a QR code from the URL https://openai.com",
      "Make a QR code image for the string 'Contact: John Doe, +1234567890'",
      "Generate a QR code for the URL https://github.com",
      "Create a QR code from the text 'Event: Meeting at 3 PM'",
      "Generate a QR code image for the URL https://news.ycombinator.com",
      "Create a QR code for the string 'WiFi Network: MyHomeWiFi, Password: 12345678'",
      "Produce a QR code for the URL https://weather.com",
      "Generate a QR code image from the text 'Scan to join the newsletter!'",
      "Produce a QR code image from the URL https://openai.com/blog",
      "I need a QR code for the website https://openai.com",
      "Can you generate a QR code for the string 'Contact: 123-456-7890'?",
      "Please provide a QR code image for the URL https://mywebsite.org",
      "Make a QR code for the text 'Event: Conference 2024'",
      "Generate a downloadable QR code image for https://shop.example.com/product/123",
      "Create a QR code from the phrase 'Scan to join our newsletter!'",
      "I want a QR code for the URL https://github.com/user/repo",
      "Produce a QR code image for the text 'WiFi Password: guest1234'",
      "Generate a QR code for the link https://docs.example.com/api",
      "Make a QR code image from the text 'Follow us on social media!'",
      "Create a QR code for the URL https://blog.example.net/article/456",
      "Generate a QR code for the URL https://example.com",
      "Create a QR code image from the string 'Hello World'",
      "Please provide a downloadable QR code for the URL https://openai.com",
      "Make a QR code from the text 'Contact: John Doe, +1234567890'",
      "Generate a QR code image for the URL https://github.com",
      "Create a QR code from the string 'Event: Conference 2024, Date: June 15'",
      "Generate a QR code for the URL https://news.ycombinator.com",
      "Produce a QR code image from the text 'WiFi Network: MyNetwork, Password: password123'",
      "Create a QR code for the URL https://www.wikipedia.org",
      "Generate a QR code from the string 'Scan this code to get 20% off!'",
      "Make a QR code image for the URL https://openweathermap.org",
      "Create a QR code from the text 'Join our Slack at https://join.slack.com/example'",
      "Generate a downloadable QR code image for the URL https://www.python.org",
      "I need a downloadable QR code for the link https://openai.com",
      "Please provide a QR code image for the string 'Contact: 123-456-7890'",
      "Make a QR code for https://github.com with a downloadable PNG file",
      "Get me a QR code image for the URL https://news.ycombinator.com",
      "Generate a QR code from the text 'Event Date: 2024-07-01'",
      "Create a QR code image for the website https://weather.com"
    ]
  },
  {
    "cluster_id": 10,
    "queries": [
      "Get the 10-day weather forecast for coordinates 34.0522,-118.2437.",
      "Get the 10-day weather forecast for coordinates 51.5074,-0.1278.",
      "Get the 10-day weather forecast for coordinates 40.7128,-74.0060.",
      "Get the 10-day weather forecast for coordinates 48.8566,2.3522.",
      "Get the 10-day weather forecast for coordinates 35.6895,139.6917.",
      "Get the 10-day weather forecast for coordinates -33.8688,151.2093.",
      "Get the 10-day weather forecast for coordinates 55.7558,37.6173.",
      "Get the 10-day weather forecast for coordinates 37.7749,-122.4194.",
      "Get the 10-day weather forecast for coordinates 41.8781,-87.6298.",
      "Get the 10-day weather forecast for coordinates 19.4326,-99.1332.",
      "Fetch the 12-day weather summary for the point at latitude 40.7128 and longitude -74.0060.",
      "Fetch the 12-day weather summary for the point at latitude 34.0522 and longitude -118.2437.",
      "Fetch the 12-day weather summary for the point at latitude 51.5074 and longitude -0.1278.",
      "Fetch the 12-day weather summary for the point at latitude 48.8566 and longitude 2.3522.",
      "Fetch the 12-day weather summary for the point at latitude 35.6895 and longitude 139.6917.",
      "Fetch the 12-day weather summary for the point at latitude -33.8688 and longitude 151.2093.",
      "Fetch the 12-day weather summary for the point at latitude 55.7558 and longitude 37.6173.",
      "Fetch the 12-day weather summary for the point at latitude 37.7749 and longitude -122.4194.",
      "Fetch the 12-day weather summary for the point at latitude 41.8781 and longitude -87.6298.",
      "Fetch the 12-day weather summary for the point at latitude 19.4326 and longitude -99.1332.",
      "Show the forecast for the next week at 40.7128,-74.0060.",
      "Show the forecast for the next week at 34.0522,-118.2437.",
      "Show the forecast for the next week at 51.5074,-0.1278.",
      "Show the forecast for the next week at 48.8566,2.3522.",
      "Show the forecast for the next week at 35.6895,139.6917.",
      "Show the forecast for the next week at -33.8688,151.2093.",
      "Show the forecast for the next week at 55.7558,37.6173.",
      "Show the forecast for the next week at 37.7749,-122.4194.",
      "Show the forecast for the next week at 41.9028,12.4964.",
      "Show the forecast for the next week at 52.5200,13.4050.",
      "Retrieve the weather forecast for the upcoming 5 days at 40.7128,-74.0060.",
      "Retrieve the weather forecast for the upcoming 5 days at 34.0522,-118.2437.",
      "Retrieve the weather forecast for the upcoming 5 days at 51.5074,-0.1278.",
      "Retrieve the weather forecast for the upcoming 5 days at 48.8566,2.3522.",
      "Retrieve the weather forecast for the upcoming 5 days at 35.6895,139.6917.",
      "Retrieve the weather forecast for the upcoming 5 days at 55.7558,37.6173.",
      "Retrieve the weather forecast for the upcoming 5 days at -33.8688,151.2093.",
      "Retrieve the weather forecast for the upcoming 5 days at 41.8781,-87.6298.",
      "Retrieve the weather forecast for the upcoming 5 days at 37.7749,-122.4194.",
      "Retrieve the weather forecast for the upcoming 5 days at 52.5200,13.4050.",
      "Get the extended two-week weather outlook for the location 34.0522,-118.2437.",
      "Get the extended two-week weather outlook for the location 51.5074,-0.1278.",
      "Get the extended two-week weather outlook for the location 40.7128,-74.0060.",
      "Get the extended two-week weather outlook for the location 48.8566,2.3522.",
      "Get the extended two-week weather outlook for the location 35.6895,139.6917.",
      "Get the extended two-week weather outlook for the location -33.8688,151.2093.",
      "Get the extended two-week weather outlook for the location 55.7558,37.6173.",
      "Get the extended two-week weather outlook for the location 37.7749,-122.4194.",
      "Get the extended two-week weather outlook for the location 19.4326,-99.1332.",
      "Get the extended two-week weather outlook for the location 59.3293,18.0686.",
      "Fetch the next six days of weather data for coordinates 40.7128,-74.0060.",
      "Fetch the next six days of weather data for coordinates 34.0522,-118.2437.",
      "Fetch the next six days of weather data for coordinates 51.5074,-0.1278.",
      "Fetch the next six days of weather data for coordinates 48.8566,2.3522.",
      "Fetch the next six days of weather data for coordinates 35.6895,139.6917.",
      "Fetch the next six days of weather data for coordinates -33.8688,151.2093.",
      "Fetch the next six days of weather data for coordinates 55.7558,37.6173.",
      "Fetch the next six days of weather data for coordinates 19.4326,-99.1332.",
      "Fetch the next six days of weather data for coordinates 37.7749,-122.4194.",
      "Fetch the next six days of weather data for coordinates 52.5200,13.4050.",
      "Show the thirteen day weather forecast for 40.7128,-74.0060.",
      "Show the thirteen day weather forecast for 34.0522,-118.2437.",
      "Show the thirteen day weather forecast for 51.5074,-0.1278.",
      "Show the thirteen day weather forecast for 48.8566,2.3522.",
      "Show the thirteen day weather forecast for 35.6895,139.6917.",
      "Show the thirteen day weather forecast for 55.7558,37.6173.",
      "Show the thirteen day weather forecast for -33.8688,151.2093.",
      "Show the thirteen day weather forecast for 41.8781,-87.6298.",
      "Show the thirteen day weather forecast for 37.7749,-122.4194.",
      "Show the thirteen day weather forecast for 52.5200,13.4050.",
      "Retrieve daily predictions for the next 3 days at 40.7128,-74.0060.",
      "Retrieve daily predictions for the next 3 days at 34.0522,-118.2437.",
      "Retrieve daily predictions for the next 3 days at 51.5074,-0.1278.",
      "Retrieve daily predictions for the next 3 days at 48.8566,2.3522.",
      "Retrieve daily predictions for the next 3 days at 35.6895,139.6917.",
      "Retrieve daily predictions for the next 3 days at 55.7558,37.6173.",
      "Retrieve daily predictions for the next 3 days at -33.8688,151.2093.",
      "Retrieve daily predictions for the next 3 days at 52.5200,13.4050.",
      "Retrieve daily predictions for the next 3 days at 19.4326,-99.1332.",
      "Retrieve daily predictions for the next 3 days at 37.7749,-122.4194.",
      "Get the weather forecast 7 days ahead for the point 40.7128,-74.0060.",
      "Get the weather forecast 7 days ahead for the point 34.0522,-118.2437.",
      "Get the weather forecast 7 days ahead for the point 51.5074,-0.1278.",
      "Get the weather forecast 7 days ahead for the point 48.8566,2.3522.",
      "Get the weather forecast 7 days ahead for the point 35.6895,139.6917.",
      "Get the weather forecast 7 days ahead for the point 55.7558,37.6173.",
      "Get the weather forecast 7 days ahead for the point -33.8688,151.2093.",
      "Get the weather forecast 7 days ahead for the point 37.7749,-122.4194.",
      "Get the weather forecast 7 days ahead for the point 41.9028,12.4964.",
      "Get the weather forecast 7 days ahead for the point 52.5200,13.4050.",
      "Fetch a one week weather forecast for 34.0522,-118.2437.",
      "Fetch a one week weather forecast for 51.5074,-0.1278.",
      "Fetch a one week weather forecast for 40.7128,-74.0060.",
      "Fetch a one week weather forecast for 48.8566,2.3522.",
      "Fetch a one week weather forecast for 35.6895,139.6917.",
      "Fetch a one week weather forecast for -33.8688,151.2093.",
      "Fetch a one week weather forecast for 55.7558,37.6173.",
      "Fetch a one week weather forecast for 41.8781,-87.6298.",
      "Fetch a one week weather forecast for 37.7749,-122.4194.",
      "Fetch a one week weather forecast for 19.4326,-99.1332."
    ]
  }
]