[
  {
    "cluster_id": 1,
    "queries": [
      "What are the latitude and longitude coordinates for 1600 Pennsylvania Avenue NW, Washington, DC?",
      "Can you provide the geographic coordinates for the Empire State Building address?",
      "I need the lat and lng for 221B Baker Street, London.",
      "Find the GPS coordinates of the Statue of Liberty National Monument.",
      "Get the latitude and longitude for the address 10 Downing Street, London.",
      "Convert the address '350 Fifth Avenue, New York, NY' into geographic coordinates.",
      "Provide the geocoordinates for the Eiffel Tower in Paris.",
      "What are the exact latitude and longitude values for the Sydney Opera House address?",
      "Retrieve the latitude and longitude for the White House address.",
      "Give me the geographic coordinates for 1 Infinite Loop, Cupertino, CA.",
      "Find the lat/lng for the address of the Golden Gate Bridge.",
      "Get the geolocation coordinates for Times Square in New York City.",
      "Please provide the latitude and longitude for the address 742 Evergreen Terrace.",
      "What are the latitude and longitude coordinates for this address?",
      "Can you find the geographic coordinates of this location?",
      "Please convert this address into latitude and longitude.",
      "I need the GPS coordinates for a given address.",
      "Get the latitude and longitude for the following address.",
      "Find the coordinates corresponding to this street address.",
      "Provide the geocoordinates for this physical address.",
      "What is the exact location in terms of lat and lng for this address?",
      "Retrieve the geographic position for this given address.",
      "Convert this place's address into its geographic coordinates.",
      "Give me the latitude and longitude for the specified address.",
      "Locate this address on the map using its coordinates.",
      "Find the geolocation coordinates for this address.",
      "What are the latitude and longitude coordinates for 1600 Amphitheatre Parkway, Mountain View, CA?",
      "Can you provide the geographic coordinates for 350 Fifth Avenue, New York, NY?",
      "Find the latitude and longitude for 221B Baker Street, London.",
      "Give me the coordinates for the address 1 Infinite Loop, Cupertino, CA.",
      "What is the geolocation (latitude and longitude) of 10 Downing Street, London?",
      "Retrieve the GPS coordinates for 742 Evergreen Terrace, Springfield.",
      "Convert the address 1600 Pennsylvania Avenue NW, Washington, DC into latitude and longitude.",
      "Get the geographic coordinates for 11 Wall Street, New York, NY.",
      "Provide the latitude and longitude for the address 500 S Buena Vista Street, Burbank, CA.",
      "What latitude and longitude correspond to 30 Rockefeller Plaza, New York, NY?",
      "Find the geographic coordinates of 4059 Mt Lee Dr, Hollywood, CA.",
      "Can you geocode the address 350 5th Ave, New York, NY 10118?",
      "Locate the latitude and longitude for 221 Main Street, San Francisco, CA.",
      "Can you provide the geographic coordinates for 221B Baker Street, London?",
      "I need the latitude and longitude for the Empire State Building address.",
      "Find the geocoordinates for 10 Downing Street, London, UK.",
      "Get the latitude and longitude of the Eiffel Tower's address.",
      "What is the geolocation of Times Square in New York City based on its address?",
      "Convert the address 350 Fifth Avenue, New York, NY into latitude and longitude.",
      "Please provide the geographic coordinates for the Sydney Opera House address.",
      "Find the latitude and longitude for the Golden Gate Bridge address.",
      "What are the coordinates for the address 1 Infinite Loop, Cupertino, CA?",
      "Provide the latitude and longitude for the address 1600 Amphitheatre Parkway, Mountain View, CA.",
      "Get the geocoordinates of the Statue of Liberty's address.",
      "Can you convert the address 4059 Mt Lee Dr, Hollywood, CA into latitude and longitude?",
      "I need the latitude and longitude for the address 350 Fifth Avenue, New York, NY.",
      "Find the geocoordinates for 10 Downing Street, London.",
      "What is the latitude and longitude of the Empire State Building?",
      "Get the geographic coordinates for 1 Infinite Loop, Cupertino, CA.",
      "Provide the latitude and longitude for the address 742 Evergreen Terrace, Springfield.",
      "Can you convert the address 1600 Amphitheatre Parkway, Mountain View, CA into coordinates?",
      "Retrieve the geographic location for 11 Wall Street, New York, NY.",
      "What are the coordinates for the Statue of Liberty National Monument?",
      "Find the latitude and longitude for the address 500 S Buena Vista Street, Burbank, CA.",
      "Give me the geographic coordinates for the White House address.",
      "Obtain the latitude and longitude for 4059 Mt Lee Drive, Los Angeles, CA.",
      "Can you find the geographic coordinates of 221B Baker Street, London?",
      "Please provide the geocoordinates for 1 Infinite Loop, Cupertino, CA.",
      "What is the exact location in terms of lat and lng for 10 Downing Street, London?",
      "Find the GPS coordinates for the address 500 S Buena Vista Street, Burbank, CA.",
      "Get the latitude and longitude for 1600 Amphitheatre Parkway, Mountain View, CA.",
      "Can you convert the address 742 Evergreen Terrace, Springfield into latitude and longitude?",
      "Provide the geographic coordinates for the Empire State Building address.",
      "I want to know the lat and lng for the Statue of Liberty National Monument address.",
      "Find the coordinates of the White House address in Washington, DC.",
      "Get the latitude and longitude for the Sydney Opera House address in Australia.",
      "What are the geocoordinates for the Eiffel Tower address in Paris?",
      "Can you provide the geographic coordinates for the Empire State Building in New York?",
      "I need the lat/lng for the address 221B Baker Street, London.",
      "Find the latitude and longitude of 10 Downing Street, London.",
      "Get the coordinates for the Sydney Opera House.",
      "What is the geocode for 350 Fifth Avenue, New York, NY?",
      "Provide the latitude and longitude for the address 1 Infinite Loop, Cupertino, CA.",
      "Convert the address 1600 Pennsylvania Avenue NW, Washington, DC into geographic coordinates.",
      "Give me the latitude and longitude coordinates for Eiffel Tower, Paris.",
      "Find the geographic coordinates for Times Square, New York City.",
      "What are the GPS coordinates for the White House?",
      "Get the lat/lng for 500 S Buena Vista Street, Burbank, CA.",
      "Provide the geolocation coordinates for 4059 Mt Lee Dr, Hollywood, CA.",
      "Find the geocoordinates for the Eiffel Tower's address in Paris.",
      "Give me the latitude and longitude for 10 Downing Street, London.",
      "Convert the address 1 Infinite Loop, Cupertino, CA into geographic coordinates.",
      "What is the latitude and longitude of the Statue of Liberty's address?",
      "Provide the geocode for 742 Evergreen Terrace, Springfield.",
      "Get the geographic coordinates for the Sydney Opera House address.",
      "Find the latitude and longitude for the address 1600 Amphitheatre Parkway, Mountain View, CA.",
      "Obtain the coordinates for the Empire State Building's address.",
      "Can you geocode the address of the Golden Gate Bridge?",
      "Retrieve the latitude and longitude for 4059 Mt Lee Dr, Hollywood, CA.",
      "Can you convert this street address into geographic coordinates?",
      "I need to find the GPS coordinates for a given location address.",
      "Please provide the lat/lng for a specific physical address.",
      "How can I get the geographic coordinates from an address?",
      "Show me the latitude and longitude of this place based on its address."
    ]
  },
  {
    "cluster_id": 2,
    "queries": [
      "What is the address for latitude 40.7128 and longitude -74.0060?",
      "Can you find the location name at coordinates 34.0522, -118.2437?",
      "Give me the full address for the GPS point 51.5074, -0.1278.",
      "What's the nearest address to latitude 48.8566 and longitude 2.3522?",
      "Retrieve the street address for coordinates 35.6895, 139.6917.",
      "Identify the place located at lat 55.7558 and lon 37.6173.",
      "Find the postal address corresponding to latitude 37.7749, longitude -122.4194.",
      "Can you provide the detailed address for lat 28.6139 and lon 77.2090?",
      "Get the location details for the point at latitude 52.5200 and longitude 13.4050.",
      "What address is at coordinates 41.9028, 12.4964?",
      "Show me the place name for latitude 19.4326 and longitude -99.1332.",
      "Provide the text address for GPS coordinates 43.6532, -79.3832.",
      "Look up the address at latitude 31.2304 and longitude 121.4737.",
      "What is the address for the coordinates 40.7128 latitude and -74.0060 longitude?",
      "Can you find the location name at latitude 34.0522 and longitude -118.2437?",
      "Please provide the full address corresponding to latitude 51.5074 and longitude -0.1278.",
      "I have the coordinates latitude 48.8566 and longitude 2.3522; what is the nearest address?",
      "Give me the textual address for the point at lat 35.6895 and lon 139.6917.",
      "Find the street address for latitude 55.7558 and longitude 37.6173.",
      "What location corresponds to latitude 37.7749 and longitude -122.4194?",
      "Retrieve the address linked with the coordinates lat 52.5200 and lon 13.4050.",
      "Identify the place at geographic coordinates latitude 41.9028 and longitude 12.4964.",
      "Get me the full address for the latitude 19.4326 and longitude -99.1332 point.",
      "What is the nearest address to latitude 43.6532 and longitude -79.3832?",
      "Locate the address for the coordinates lat 1.3521 and lon 103.8198.",
      "Provide the detailed address for the location at latitude 39.9042 and longitude 116.4074.",
      "What is the address at latitude 40.7128 and longitude -74.0060?",
      "Can you find the location details for the coordinates 34.0522 latitude and -118.2437 longitude?",
      "Give me the street address corresponding to latitude 51.5074 and longitude -0.1278.",
      "Retrieve the full address for the GPS coordinates lat 48.8566 and lon 2.3522.",
      "What place is located at latitude 35.6895 and longitude 139.6917?",
      "Find the address for the coordinates with latitude 55.7558 and longitude 37.6173.",
      "Provide the reverse geocode information for lat 19.0760 and lon 72.8777.",
      "Get the postal address from latitude 40.730610 and longitude -73.935242.",
      "Tell me the address details for the location at 37.7749 latitude and -122.4194 longitude.",
      "Convert the coordinates 41.9028 latitude and 12.4964 longitude into an address.",
      "What is the street name and number for the coordinates lat 52.5200 and lon 13.4050?",
      "Identify the location described by latitude 39.9042 and longitude 116.4074.",
      "Lookup the address from GPS coordinates 34.052235 latitude and -118.243683 longitude.",
      "Can you find the location details for latitude 51.5074 and longitude -0.1278?",
      "Please provide the full address corresponding to the coordinates 34.0522, -118.2437.",
      "I have the latitude 48.8566 and longitude 2.3522, what address does this point to?",
      "Give me the street address for the GPS coordinates 35.6895 latitude and 139.6917 longitude.",
      "Find the place name located at latitude 55.7558 and longitude 37.6173.",
      "What is the physical address for the coordinates 19.4326 latitude and -99.1332 longitude?",
      "Retrieve the address from the latitude and longitude values 40.730610, -73.935242.",
      "Could you convert the coordinates 37.7749 latitude and -122.4194 longitude into an address?",
      "Get the location information for the coordinates 41.9028 latitude and 12.4964 longitude.",
      "Identify the address at latitude 52.5200 and longitude 13.4050.",
      "What street or place corresponds to the GPS coordinates 39.9042 latitude and 116.4074 longitude?",
      "Provide the detailed address for the latitude 1.3521 and longitude 103.8198.",
      "Can you find the location name for latitude 51.5074 and longitude -0.1278?",
      "Give me the full address corresponding to latitude 34.0522 and longitude -118.2437.",
      "Retrieve the address details for the coordinate pair 48.8566 latitude and 2.3522 longitude.",
      "What location is at latitude 35.6895 and longitude 139.6917?",
      "Find the address from latitude 55.7558 and longitude 37.6173.",
      "Provide the postal address for the coordinates lat 19.4326 and lon -99.1332.",
      "What is the place name for latitude 28.6139 and longitude 77.2090?",
      "Get the street address for lat 52.5200 and lon 13.4050.",
      "Identify the address at latitude 41.9028 and longitude 12.4964.",
      "Show me the location details for latitude 37.7749 and longitude -122.4194.",
      "Find the address corresponding to the GPS coordinates 1.3521 latitude and 103.8198 longitude.",
      "Convert latitude 43.6532 and longitude -79.3832 into a formatted address.",
      "Can you find the location name for the coordinates 34.0522, -118.2437?",
      "Give me the street address for the point with latitude 51.5074 and longitude -0.1278.",
      "Find the full address corresponding to latitude 48.8566 and longitude 2.3522.",
      "Retrieve the place name for latitude 35.6895 and longitude 139.6917.",
      "What is the physical address at coordinates 55.7558, 37.6173?",
      "Provide the location details for latitude 37.7749 and longitude -122.4194.",
      "Get an address based on the latitude 52.5200 and longitude 13.4050.",
      "Identify the place located at latitude 41.9028 and longitude 12.4964.",
      "Convert latitude 19.0760 and longitude 72.8777 into a street address.",
      "Find the address for the GPS coordinates 40.4168, -3.7038.",
      "Tell me the location name at latitude 1.3521 and longitude 103.8198.",
      "What address corresponds to latitude -33.8688 and longitude 151.2093?",
      "Can you find the location details for coordinates 34.0522, -118.2437?",
      "Give me the full address for the GPS point with latitude 51.5074 and longitude -0.1278.",
      "Retrieve the place name corresponding to latitude 48.8566 and longitude 2.3522.",
      "Find the nearest address to latitude 35.6895 and longitude 139.6917.",
      "Convert the coordinates 55.7558, 37.6173 into a human-readable address.",
      "What location is at lat 19.4326 and lon -99.1332?",
      "Get the street address for the given GPS coordinates 40.4168, -3.7038.",
      "Show me the address for the coordinate point with latitude 52.5200 and longitude 13.4050.",
      "Provide the location information for latitude 37.7749 and longitude -122.4194.",
      "Identify the place located at lat 41.9028 and lon 12.4964.",
      "Find the complete address from latitude 43.6532 and longitude -79.3832.",
      "What is the textual address for coordinates latitude 31.2304 and longitude 121.4737?",
      "What is the address for the coordinates latitude 40.7128 and longitude -74.0060?",
      "Can you find the location name from latitude 34.0522 and longitude -118.2437?",
      "Give me the full address corresponding to latitude 51.5074 and longitude -0.1278.",
      "What's the place located at latitude 48.8566 and longitude 2.3522?",
      "Retrieve the address for the GPS coordinates latitude 35.6895 and longitude 139.6917.",
      "Provide the location details for coordinates lat 37.7749 and lon -122.4194.",
      "Get the address from latitude 19.4326 and longitude -99.1332.",
      "What is the physical address at latitude 41.9028 and longitude 12.4964?",
      "Can you reverse geocode the coordinates latitude 52.5200 and longitude 13.4050 to an address?",
      "Find the nearest address to latitude 59.3293 and longitude 18.0686.",
      "Show me the place name for latitude 1.3521 and longitude 103.8198.",
      "Convert the coordinates lat 43.6532 and lon -79.3832 into a full address.",
      "What is the address for the location at latitude 40.7128 and longitude -74.0060?"
    ]
  },
  {
    "cluster_id": 3,
    "queries": [
      "What are the latest top news headlines in the United States?",
      "Show me the current breaking news headlines for technology worldwide.",
      "Give me the most recent news articles about climate change in Canada.",
      "Fetch the top news headlines for sports in the United Kingdom.",
      "Get the latest news stories published today about artificial intelligence.",
      "Provide the newest headlines related to health and medicine in Australia.",
      "What are the current top headlines from multiple news sources in India?",
      "Retrieve recent news articles about the economy in Germany.",
      "Show me the latest global news updates on political events.",
      "Fetch breaking news headlines about entertainment in France.",
      "Get the most recent top stories related to education in Brazil.",
      "Provide today’s latest news about renewable energy in Japan.",
      "Show the newest news headlines for business in South Africa.",
      "Show me the most recent breaking news articles about technology worldwide.",
      "Can you provide the current top stories for the sports category in Canada?",
      "Find the newest news headlines related to climate change globally.",
      "Get the latest news articles from multiple sources about finance in the UK.",
      "What are today's top headlines for politics in Australia?",
      "Retrieve the most recent news stories about healthcare in Germany.",
      "Show me the latest world news articles published in Spanish.",
      "Provide the newest breaking news headlines for entertainment in India.",
      "Get current top news articles mentioning electric vehicles worldwide.",
      "Find recent news headlines from a specific news website about education.",
      "What are the top headlines for business news in France today?",
      "Show me the latest news articles published today about artificial intelligence.",
      "Show me breaking news stories from the technology sector in India.",
      "Get the most recent news articles about climate change worldwide.",
      "Find the newest headlines related to sports in Canada.",
      "Provide the latest news updates from financial markets in the UK.",
      "Retrieve current top stories about healthcare in Australia.",
      "What are the most recent world news headlines available?",
      "Show me breaking news articles about politics in Germany.",
      "Get the latest news from multiple sources about renewable energy.",
      "Provide recent headlines on entertainment news in France.",
      "Find the newest articles on education topics globally.",
      "Show the top breaking news for a specific news website in Brazil.",
      "Retrieve the latest headlines sorted by publication date about cybersecurity.",
      "Show me the most recent breaking news stories from the technology sector.",
      "Get the current top headlines for Canada.",
      "Provide the latest news articles about climate change worldwide.",
      "Fetch the newest news stories in English from the sports category.",
      "Give me the top breaking headlines from multiple news sources in the UK.",
      "Find recent news articles about artificial intelligence.",
      "Retrieve the latest world news headlines from Google News.",
      "Show the most recent news updates for Australia in the health category.",
      "Get the top news stories published today in Germany.",
      "Provide the latest headlines containing the keyword 'economy'.",
      "Fetch breaking news articles sorted by earliest publish date first.",
      "Give me the newest news headlines for France filtered by language and topic.",
      "Show me the breaking news stories from the technology category in the UK.",
      "Can you provide the most recent news articles about climate change worldwide?",
      "Get the newest headlines for sports news in Canada.",
      "Find the latest political news articles published today in Australia.",
      "Retrieve the top news stories from multiple news sources in Germany.",
      "What are the current trending news topics in India?",
      "Show me recent news headlines in Spanish from Mexico.",
      "Get the latest business news headlines from France.",
      "Find breaking news related to health and medicine globally.",
      "Provide the newest articles about cryptocurrency in Japan.",
      "What are the most recent entertainment news headlines in Brazil?",
      "Show me top headlines containing the keyword 'election' in South Africa.",
      "Show me the latest top news headlines for the United States.",
      "What are the current breaking news stories in technology worldwide?",
      "Get the most recent news articles about climate change.",
      "Fetch the latest top headlines from Canada.",
      "Provide the newest news updates on sports in the UK.",
      "List the current top news stories in politics for Germany.",
      "Find the latest headlines about the stock market in Japan.",
      "Show me breaking news articles related to healthcare globally.",
      "Get the newest news headlines for France in French language.",
      "Retrieve the most recent news about artificial intelligence worldwide.",
      "What are today's top headlines in entertainment for Australia?",
      "Fetch recent news articles about renewable energy in India.",
      "Provide the latest world news headlines from Google News.",
      "What are the latest top news headlines for the United States?",
      "Show me the most recent breaking news stories from the technology category in Canada.",
      "Get the current top headlines about climate change worldwide.",
      "Find the newest news articles related to sports in the United Kingdom.",
      "Retrieve the latest news updates for business in Australia.",
      "Give me the most recent headlines from multiple news sources in India.",
      "Search for the latest news articles about electric vehicles globally.",
      "Provide the top breaking news headlines for Germany today.",
      "Show the newest news stories about health and wellness in France.",
      "Get the current top headlines filtered by keyword 'stock market' in Japan.",
      "Find recent news articles published today about artificial intelligence worldwide.",
      "Retrieve the latest news headlines from a specific news website in Brazil.",
      "What are the top breaking news headlines for entertainment in South Africa?",
      "What are the latest news headlines in the United States?",
      "Show me the top breaking news stories in technology worldwide.",
      "Get the most recent news articles about climate change in Europe.",
      "Find the current top headlines for sports in Canada.",
      "Retrieve the latest news updates on healthcare from multiple sources.",
      "What are today's top political news stories in India?",
      "Fetch the newest headlines related to finance and economy globally.",
      "Provide the latest news about entertainment in the United Kingdom.",
      "Show recent breaking news articles about cybersecurity in Australia.",
      "Get the top news stories by keyword 'artificial intelligence' worldwide.",
      "Find the latest news headlines for the category 'business' in Germany.",
      "Retrieve current top stories from a specific news source in France.",
      "What are the most recent global headlines sorted by publish date?"
    ]
  },
  {
    "cluster_id": 4,
    "queries": [
      "What is the geographical location of this IP address?",
      "Can you provide the city and country for this IP address?",
      "Where is this IP address located?",
      "Give me the latitude and longitude coordinates for this IP address.",
      "Find the timezone associated with this IP address.",
      "Retrieve detailed location information for this IP address.",
      "What is the ASN and currency linked to this IP address?",
      "Get security-related data for this IP address.",
      "Provide the full geolocation data for the given IP address.",
      "Look up the IP address and tell me which city it belongs to.",
      "Find the country and region for this IP address.",
      "Show me the location details of this IP address in JSON format.",
      "Get the IP geolocation data including location and network details.",
      "Can you provide the city and country for a given IP address?",
      "Show me the latitude and longitude coordinates for an IP address.",
      "Find the timezone associated with a specific IP address.",
      "Retrieve detailed location data based on an IP address.",
      "Get the country and city information for an IP address.",
      "Look up the geolocation information of an IP address.",
      "Provide the geolocation details such as city, country, and coordinates for this IP.",
      "Where is this IP address located geographically?",
      "Fetch the geolocation data including latitude, longitude, and city for an IP address.",
      "Get location and related info for a given IP address.",
      "Identify the physical location tied to an IP address.",
      "Retrieve the IP address location data including region and country.",
      "Find the latitude and longitude coordinates of this IP address.",
      "Give me detailed location information for the IP address I provide.",
      "Locate the IP address including timezone and currency details.",
      "Retrieve geolocation data for a specific IP address.",
      "Get the country and city associated with this IP address.",
      "Show me all available location and network details for the given IP.",
      "Provide the ASN and security information for this IP address.",
      "Find where this IP address is located geographically.",
      "Lookup the IP address and return its geolocation info.",
      "Get complete geolocation and network data for an IP address.",
      "What city, country, and coordinates correspond to this IP?",
      "Can you find the city and country for this IP address?",
      "Show me the latitude and longitude coordinates for this IP address.",
      "Retrieve the timezone information associated with this IP address.",
      "Get detailed location data including country, city, and coordinates for this IP address.",
      "Provide the geolocation details for this specific IP address.",
      "Where is this IP address located on the map?",
      "Find the IP address location along with any relevant security data.",
      "Give me the ASN and currency information related to this IP address.",
      "Look up the geographic location of this IP address and return it in JSON format.",
      "Get all possible location data for this IP address including city, country, and timezone.",
      "Determine the IP address's location and provide details about its network and region.",
      "Fetch the full geolocation profile of this IP address including latitude, longitude, and timezone.",
      "Can you provide the city and country for a given IP?",
      "Retrieve the latitude and longitude coordinates of an IP address.",
      "Get detailed location information including city, country, and region for an IP.",
      "Show me the geolocation data for an IPv4 or IPv6 address.",
      "Look up the location of an IP address including its ASN and currency.",
      "Provide security-related data and location info for a specific IP.",
      "Identify the country and city for a given IP address.",
      "Fetch complete geolocation details for this IP address.",
      "What is the longitude and latitude of this IP address?",
      "Get the IP address location data in JSON format.",
      "Determine the location and other metadata related to an IP address.",
      "What is the geolocation information for the IP address 8.8.8.8?",
      "Can you provide the city and country for the IP address 123.45.67.89?",
      "Find the latitude and longitude coordinates for this IP: 192.168.1.1.",
      "Get the timezone associated with the IP address 203.0.113.5.",
      "Retrieve detailed location data including ASN and currency for IP 85.214.132.117.",
      "Show me the security details and geolocation for the IP address 172.16.254.1.",
      "Where is the IP address 66.249.66.1 located geographically?",
      "Provide full geolocation info for the IP 2001:0db8:85a3:0000:0000:8a2e:0370:7334 (IPv6).",
      "Get the country and city data for the IP 45.33.32.156.",
      "Look up the geolocation details of the IP address 157.240.22.35.",
      "What location data can you find for the IP 91.198.174.192?",
      "Fetch the IP location including latitude and longitude for 104.244.42.129.",
      "Provide geolocation information such as city, country, and timezone for IP 203.0.113.195.",
      "Give me the latitude and longitude coordinates for a specific IP.",
      "Show me detailed location data for this IP address.",
      "Get the country and city from this IP address.",
      "Find the geolocation info for an IPv4 or IPv6 address.",
      "Determine the IP address location including coordinates.",
      "Provide security or ASN details linked to this IP address.",
      "Look up the location of an IP address including city and country.",
      "Get the IP geolocation data with currency and timezone info.",
      "What are the location details for this given IP address?",
      "Fetch the location and related geolocation information for an IP.",
      "What is the location of this IP address?",
      "Can you find the city and country for this IP?",
      "Show me the geolocation details for a given IP address.",
      "Retrieve the latitude and longitude for this IP.",
      "Get the timezone information associated with this IP address.",
      "Provide the ASN and ISP details for this IP.",
      "Find the currency used in the location of this IP address.",
      "What security data is available for this IP address?",
      "Lookup geolocation data for an IPv4 or IPv6 address.",
      "Get detailed location info including city, country, and coordinates for an IP.",
      "Provide all possible location-related data for this IP address.",
      "Fetch comprehensive IP geolocation information for a given IP.",
      "Can you find the city and country for a given IP address?",
      "Retrieve the latitude and longitude coordinates for an IP address.",
      "Get detailed location info including timezone and currency for an IP address.",
      "Find the ASN and security details of a specific IP address.",
      "Show me the geolocation data for an IP address I provide.",
      "Where is this IP address located in terms of city, country, and region?"
    ]
  },
  {
    "cluster_id": 5,
    "queries": [
      "Can you provide the WHOIS information for the domain example.com?",
      "I want to find the registration details of the domain openai.com.",
      "Please look up the domain ownership data for wikipedia.org.",
      "Show me the WHOIS record for the domain github.com.",
      "Retrieve the registrar and contact info for the domain stackoverflow.com.",
      "Get the expiration date and name servers of the domain cnn.com.",
      "Find the WHOIS details for the domain amazon.com.",
      "Can you check the domain registration info for nytimes.com?",
      "Provide the WHOIS data for the domain microsoft.com.",
      "I need the domain ownership and contact information for facebook.com.",
      "Look up the registration details for the domain twitter.com.",
      "Fetch the WHOIS record including registrar info for linkedin.com.",
      "Get the full WHOIS information for the domain reddit.com.",
      "I want to look up the registration details for the domain openai.com.",
      "Please retrieve the domain ownership and registration data for wikipedia.org.",
      "Show me the WHOIS records for the domain github.com.",
      "Fetch the registrar and contact details for the domain microsoft.com.",
      "Get the expiration date and name server information for the domain amazon.com.",
      "Find the domain registration info for cnn.com.",
      "Lookup the WHOIS data for the domain stackoverflow.com.",
      "Can you get the domain WHOIS details for apple.com?",
      "Provide the registered owner and administrative contact info for the domain google.com.",
      "I need to see the WHOIS record for the domain facebook.com.",
      "Retrieve the domain name registration and DNS details for the domain twitter.com.",
      "Look up the domain info including registrar and creation date for linkedin.com.",
      "Can you provide the WHOIS information for example.com?",
      "I need to retrieve the domain registration details for openai.com.",
      "Please look up the WHOIS data for github.com.",
      "Show me the registrar and expiration date for wikipedia.org.",
      "Get the domain owner and contact information for stackoverflow.com.",
      "Find the WHOIS record for cnn.com.",
      "Retrieve the name servers and registration details for microsoft.com.",
      "Provide the WHOIS info for amazon.com.",
      "Look up domain details for twitter.com.",
      "Get the registration data and contact info for linkedin.com.",
      "Can you fetch the WHOIS record for apple.com?",
      "Show the domain information for netflix.com.",
      "Please provide the WHOIS lookup data for ebay.com.",
      "Can you provide the WHOIS information for a specific domain name?",
      "I want to look up the registration details of a domain.",
      "Retrieve the domain owner and registrar information for a given domain.",
      "Show me the expiration date and name servers of a particular domain.",
      "Get the contact information associated with a domain name.",
      "Look up WHOIS data for a domain to find its registration details.",
      "Provide the registration record including registrar and domain status for a domain.",
      "Fetch the WHOIS details for a specified domain name.",
      "Can you check the domain information including registration and expiry date?",
      "Display the domain registration information for any given domain.",
      "Find the WHOIS record of a domain to see the registrant and registrar details.",
      "Show the detailed WHOIS data for a domain name.",
      "Provide the WHOIS lookup results for a domain in a structured format.",
      "Please retrieve the WHOIS data for the domain wikipedia.org.",
      "Show me the registrar and contact info for the domain github.com.",
      "Get the domain ownership details for cnn.com.",
      "What is the expiration date and name servers for the domain amazon.com?",
      "Lookup the WHOIS record for the domain stackoverflow.com.",
      "Fetch the domain registration information for microsoft.com.",
      "Provide the WHOIS details for the domain nytimes.com.",
      "Can you check the registry data for the domain reddit.com?",
      "I need the WHOIS info for the domain linkedin.com.",
      "Give me the domain owner and registrar info for apple.com.",
      "Retrieve the WHOIS record for the domain spotify.com.",
      "I want to see the registration details of the domain openai.com.",
      "Please look up the WHOIS data for the domain google.com.",
      "Show me the domain ownership information for microsoft.com.",
      "Retrieve the WHOIS record for the domain wikipedia.org.",
      "Get the registration and contact details for the domain github.com.",
      "Find the expiration date and registrar info for the domain twitter.com.",
      "Look up the DNS and name server details for the domain amazon.com.",
      "Provide the WHOIS lookup results for the domain netflix.com.",
      "Show the domain info including registrant contacts for the domain example.net.",
      "Can you fetch the WHOIS information for the domain stackoverflow.com?",
      "I need the domain registration data for the domain linkedin.com.",
      "Get detailed WHOIS records for the domain facebook.com.",
      "Can you provide the WHOIS information for a specific domain?",
      "I want to find out the registrar and contact details for a domain name.",
      "Show me the registration details and expiration date of a particular domain.",
      "Retrieve the WHOIS record for a given domain name.",
      "Give me the domain ownership and name server information for a domain.",
      "Check the WHOIS data for a domain to see when it was registered.",
      "Can you look up domain registry info for a specific domain name?",
      "Provide the detailed WHOIS information including registrant contacts for a domain.",
      "Find out the WHOIS record in JSON or XML format for a domain name.",
      "Get the WHOIS lookup details for a domain, including registrar and expiry.",
      "Fetch the domain registration information for a given domain.",
      "Lookup the WHOIS data to see who owns a domain and their contact info.",
      "Retrieve the domain info and WHOIS data for a particular domain name.",
      "I want to look up the registration details of the domain example.net.",
      "Retrieve the domain ownership and registrar information for example.org.",
      "Get the WHOIS data including expiration date for the domain example.io.",
      "Show me the contact details associated with the domain example.edu.",
      "Look up the DNS and name server information for example.co.uk.",
      "Please find the WHOIS record for the domain example.biz.",
      "Fetch the registration and administrative contact info for example.info.",
      "Obtain the domain creation and expiration dates for example.us.",
      "Can you provide full WHOIS details for example.xyz?",
      "I need to see the domain registrant information for example.online.",
      "Retrieve the WHOIS record for example.tech domain.",
      "Get the latest WHOIS data including registrar and status for example.site.",
      "Can you provide the registration details and ownership information for a specific domain name?"
    ]
  },
  {
    "cluster_id": 6,
    "queries": [
      "Can you verify if this email address is valid and deliverable?",
      "Please check whether this email address is correctly formatted and real.",
      "Is this email address properly structured and able to receive emails?",
      "Validate this email address to ensure it is not misspelled or malformed.",
      "Check if this email address exists and can accept incoming mail.",
      "Confirm whether this email address is valid and normalized.",
      "Can you run a validation to make sure this email is active and correctly formatted?",
      "Verify the deliverability status of this email address.",
      "Please validate this email to ensure it meets syntax and domain standards.",
      "Check if this email address is valid, real, and ready for sending emails.",
      "Is this email address legitimate and properly constructed?",
      "Ensure this email address is free from errors and can receive messages.",
      "Please confirm that this email address is valid and not misspelled.",
      "Can you check if this email address is valid?",
      "Please verify whether this email is real and deliverable.",
      "I need to validate the syntax and deliverability of this email address.",
      "Is this email address properly formatted and active?",
      "Validate this email to ensure it can receive messages.",
      "Check if this email address is correctly spelled and exists.",
      "Can you confirm if this email is valid and can be used for sending emails?",
      "Please verify the authenticity and correctness of this email address.",
      "I want to make sure this email address is legitimate and reachable.",
      "Check this email address for any errors and confirm its deliverability.",
      "Can you validate this email address to avoid sending to invalid emails?",
      "Verify if this email is real and correctly formatted for sending emails.",
      "Please run a validation on this email address to ensure it’s valid and deliverable.",
      "Please check the syntax and deliverability of this email address.",
      "Is this email address correctly formatted and real?",
      "Can you confirm if this email address is active and can receive emails?",
      "Check if this email address is valid before I send an email to it.",
      "Please verify that this email address is deliverable and properly formatted.",
      "Is this email address legitimate and capable of receiving messages?",
      "Validate this email address for correctness and deliverability.",
      "Make sure this email address is real and not fake or invalid.",
      "Check the validity and deliverability status of this email address.",
      "Verify if this email address complies with proper syntax and can receive emails.",
      "Confirm the authenticity and correctness of this email address.",
      "Is this email address correctly formatted and active?",
      "Can you confirm if this email address is valid for sending emails?",
      "Please validate this email to ensure it is not misspelled or malformed.",
      "Check if this email address exists and is safe to send emails to.",
      "Validate this email address and provide any error messages if invalid.",
      "I want to verify if this email address can receive emails.",
      "Can you confirm the deliverability of this email address?",
      "Please check if the email address is valid and normalized.",
      "Verify if this email is correctly formatted and corresponds to a real mailbox.",
      "Ensure this email address is valid, real, and ready for email campaigns.",
      "Can you verify if this email address is valid?",
      "Please check the deliverability of this email address.",
      "Is this email address properly formatted and real?",
      "Validate this email address for syntax errors and deliverability.",
      "Can you confirm that this email address exists and can receive emails?",
      "Check if this email address is misspelled or malformed.",
      "Please verify a single email address to ensure it is valid.",
      "Is this email address normalized and correct?",
      "Can you validate this email address and provide error messages if invalid?",
      "Check this email address to improve my email list quality.",
      "Verify that this email address is real and not fake.",
      "Validate this email address for both syntax and delivery capability.",
      "Can you confirm whether this email address is valid and deliverable?",
      "Please check if this email is correctly formatted and deliverable.",
      "Is this email address real and active?",
      "Validate this email address for syntax and deliverability.",
      "Can you confirm if this email address exists?",
      "Please verify the deliverability of this email address.",
      "Is this email address suitable for sending emails?",
      "Can you validate this email to ensure it belongs to a real user?",
      "Perform an email validation to check if the address is correct.",
      "Check if this email address is valid and normalized.",
      "Verify if this email address will accept incoming mail.",
      "Can you run a validation check on this email address?",
      "Please check if this email is deliverable.",
      "Is this email address correctly formatted?",
      "Validate this email to ensure it exists and can receive mail.",
      "Can you confirm that this email address is not misspelled?",
      "Check if this email address is real and active.",
      "Verify the syntax and deliverability of this email address.",
      "Is this email address properly normalized and valid?",
      "Please validate this email before I send a message to it.",
      "Can you test if this email address is valid for sending emails?",
      "Check if this email address is malformed or invalid.",
      "Verify whether this email is a legitimate and working email address.",
      "Can you confirm that this email address is correctly structured and deliverable?",
      "Validate this email address to ensure it is not misspelled.",
      "Can you confirm if this email is properly structured and active?",
      "Check if this email address is valid and can receive emails.",
      "Please verify the syntax and authenticity of this email address.",
      "Is this email address valid and deliverable?",
      "Can you validate this email to make sure it's not malformed?",
      "Check the validity of this email address before I send emails to it.",
      "Please confirm if this email address exists and is reachable.",
      "Can you verify if this email address is legitimate and correctly formatted?",
      "Validate this email to ensure it belongs to a real user.",
      "Please verify whether this email is deliverable.",
      "I need to validate this email to ensure it’s not misspelled.",
      "Can you confirm if this email exists and can receive mail?",
      "Verify this email address to make sure it’s valid and active.",
      "Is this email address properly formatted and able to receive emails?",
      "Can you validate this email address for accuracy and deliverability?",
      "Please check whether this email address has the correct format and is active."
    ]
  },
  {
    "cluster_id": 7,
    "queries": [
      "Can you analyze the sentiment of this text for me?",
      "What is the overall sentiment expressed in the following paragraph?",
      "Please determine if this text has a positive or negative tone.",
      "Could you provide a sentiment analysis of this message?",
      "Tell me the sentiment scores for this block of text.",
      "I need to know the emotional tone of this written content.",
      "Analyze the following text and tell me if it’s positive, neutral, or negative.",
      "What sentiment does this text convey?",
      "Provide the sentiment breakdown for this piece of writing.",
      "Is the sentiment of this text mostly positive or negative?",
      "Give me the sentiment analysis results for this sentence.",
      "Detect the sentiment in this text passage and summarize it.",
      "Can you perform sentiment analysis on this text snippet?",
      "What is the overall sentiment of the following passage?",
      "Please determine if this text expresses positive or negative feelings.",
      "Could you provide a sentiment analysis for this block of text?",
      "I need to know the sentiment score of this message, can you help?",
      "Analyze this text and tell me if it’s positive, neutral, or negative.",
      "Give me a detailed sentiment breakdown of this paragraph.",
      "Please detect the sentiment of the following content.",
      "Can you evaluate the emotional tone of this text?",
      "Provide me with sentiment scores based on this input text.",
      "Is the overall sentiment of this text favorable or unfavorable?",
      "Analyze the affective nature of this text and summarize the sentiment.",
      "What is the sentiment of the following paragraph?",
      "Please determine if this text is positive, negative, or neutral.",
      "I need to know the overall sentiment of this text snippet.",
      "Can you tell me if the sentiment of this text is positive or negative?",
      "Please analyze the emotional tone of this text.",
      "What sentiment scores can you provide for this piece of text?",
      "Can you detect the sentiment expressed in this text?",
      "Please evaluate the sentiment polarity of this written content.",
      "Analyze this text and let me know its sentiment breakdown.",
      "Can you perform sentiment analysis on this given text?",
      "I want to understand the sentiment conveyed in this text.",
      "What is the sentiment expressed in the following paragraph?",
      "Please determine if this text has a positive or negative sentiment.",
      "Could you provide the sentiment scores for this block of text?",
      "I need a sentiment analysis of this text sample.",
      "Tell me the overall sentiment and its details for this text.",
      "Analyze the sentiment of this sentence and let me know the results.",
      "What kind of sentiment does this text convey?",
      "Please detect the emotional tone in this piece of writing.",
      "Can you give me the positive, neutral, and negative sentiment breakdown of this text?",
      "Provide a sentiment score and classification for this input text.",
      "I want to know if the sentiment in this text is mostly positive, negative, or neutral.",
      "Perform a sentiment analysis on this text and summarize the findings.",
      "What is the overall sentiment expressed in this paragraph?",
      "Could you provide the sentiment scores for this piece of writing?",
      "Analyze this text and tell me whether it's positive, neutral, or negative.",
      "I want to know the emotional tone of this text, can you help?",
      "Detect the sentiment of the following text snippet.",
      "Give me the sentiment analysis results for this text input.",
      "Can you identify the sentiment conveyed in this message?",
      "Please evaluate the sentiment polarity of this content.",
      "What sentiment does this text express according to your analysis?",
      "Provide detailed sentiment scoring including positive, neutral, and negative for this text.",
      "Analyze this text and return the sentiment along with respective scores.",
      "Please detect whether the following text is positive or negative.",
      "Could you provide a sentiment breakdown for this text?",
      "I need to know if the sentiment of this message is positive, negative, or neutral.",
      "Analyze the emotional tone of this text snippet.",
      "Tell me the sentiment scores for this piece of writing.",
      "Is the sentiment of this statement mostly positive or negative?",
      "Please perform sentiment analysis on this input text.",
      "Can you identify the feelings conveyed in this text?",
      "Give me the sentiment classification and scores for the following text.",
      "Evaluate the sentiment polarity of this given text.",
      "How does this text rate in terms of positive, neutral, and negative sentiment?",
      "Please detect whether the following text is positive, negative, or neutral.",
      "Could you determine the sentiment scores for this piece of writing?",
      "I want to know the emotional tone of this text, can you analyze it?",
      "Analyze this text and tell me the sentiment breakdown.",
      "Can you provide the sentiment analysis for this given text?",
      "What sentiment does this text convey according to your analysis?",
      "Please evaluate the sentiment polarity of this text snippet.",
      "Can you classify the sentiment of this text as positive, negative, or neutral?",
      "Provide a detailed sentiment score analysis of the following text.",
      "I need a sentiment evaluation for this text, can you help?",
      "Could you perform a sentiment analysis on this text and share the results?",
      "What is the overall sentiment of this text?",
      "Can you analyze the sentiment of the following paragraph?",
      "Please determine whether the sentiment of this text is positive or negative.",
      "Analyze the sentiment expressed in this message.",
      "Identify the sentiment and provide details of this text.",
      "Tell me the sentiment scores for this piece of text.",
      "What kind of emotional tone does this text have?",
      "Detect the sentiment in this text input.",
      "Provide a sentiment analysis for the following content.",
      "Can you classify the sentiment of this text as positive, neutral, or negative?",
      "Give me the sentiment breakdown for this text.",
      "Evaluate the sentiment conveyed in this text snippet.",
      "Please run a sentiment check on this text.",
      "What is the overall sentiment of the following paragraph?",
      "Please determine if this text expresses positive, negative, or neutral feelings.",
      "Could you provide a sentiment score for this piece of writing?",
      "I need to know the emotional tone of this text, can you help?",
      "Analyze this text and tell me if it's mostly positive or negative.",
      "Can you detect the feelings expressed in this text?",
      "Please evaluate the sentiment of this text sample."
    ]
  },
  {
    "cluster_id": 8,
    "queries": [
      "What language is this text written in?",
      "Can you identify the language of this sentence?",
      "Detect the language used in this paragraph.",
      "Which language is this text in?",
      "Find out the language of the following text.",
      "Tell me the language of this input text.",
      "Determine the language of this sentence.",
      "What is the language of this given text?",
      "Identify the language for the text provided.",
      "Please detect which language this text is.",
      "Can you tell me the language of this text snippet?",
      "What language does this text belong to?",
      "Analyze this text and detect its language.",
      "Can you identify the language of the following text?",
      "Detect the language used in this sentence.",
      "Which language does this text belong to?",
      "Tell me the language of this given text.",
      "Identify the language of this input text.",
      "Find out the language of this paragraph.",
      "What is the language code for this text?",
      "Determine the language from this text snippet.",
      "Please detect the language of this string.",
      "Analyze this text and tell me its language.",
      "Can you detect the language used here?",
      "What language is detected from this input?",
      "Detect the language used in the following text.",
      "Tell me the language of this paragraph.",
      "Find out the language of this input text.",
      "Please determine the language of the provided text.",
      "Identify the language in this message.",
      "What is the detected language code for this text?",
      "Give me the language information for this text snippet.",
      "Can you detect the language used in this content?",
      "Provide the language detection result for this text.",
      "Please tell me the language of this input text.",
      "What language does this paragraph belong to?",
      "Determine the language of the given text.",
      "Identify the language of this piece of writing.",
      "Which language is this text composed in?",
      "Find out the language of this text snippet.",
      "Can you detect the language of these sentences?",
      "Tell me the language code for this text.",
      "What is the language of the following content?",
      "Can you identify the language of the following sentence?",
      "Determine the language of this given text.",
      "Please detect the language in this sentence.",
      "Identify the language of the provided text.",
      "Tell me the language of this text snippet.",
      "Can you tell what language this text is in?",
      "What language does this string of text use?",
      "Identify the language of the given text.",
      "What is the detected language for this piece of text?",
      "Can you find out the language of this text?",
      "Determine the language of the following input.",
      "Tell me the language code of this text.",
      "From this text, what language can you detect?",
      "Please detect the language of this sentence.",
      "Can you identify the language of the following sentences?",
      "Detect the language of this paragraph for me.",
      "Please tell me the language used in this text.",
      "Find out the language of the given text.",
      "Identify the language in this passage.",
      "Determine what language this text is in.",
      "I need to know the language of this input text.",
      "Tell me the language detected from this text.",
      "Please analyze and detect the language of this text.",
      "Detect the language of this text snippet.",
      "Determine the language used in this message.",
      "Identify the language from this input text.",
      "What is the language of the provided text?",
      "Can you detect the language of this sentence?",
      "Please specify the language of this text.",
      "Give me the language code for this text.",
      "Please determine the language of the given text.",
      "What is the language of the provided text snippet?",
      "Identify the language for the following piece of text.",
      "Tell me the language in which this text is written.",
      "Can you detect the language of this text sample?",
      "Determine the language from this text input.",
      "What language does this text appear to be in?",
      "Please detect and return the language of this text.",
      "Please tell me the language of this paragraph.",
      "Which language is this piece of text in?",
      "Analyze this text and identify its language.",
      "Give me the language detected from this text.",
      "Identify the language of the following sentences.",
      "Can you detect the language from this text?",
      "Tell me the language of this sample text.",
      "Please tell me the language of the following text: 'Ich in ein Berliner.'",
      "Could you please tell me the language of this text: 'Ik hou van kaas.'",
      "Identify the following language 'Je m'apelle Claude.'",
      "What's this language? 'El gato consumar el sausage.'",
      "Could you please tell me the language of this text: 'Ein Orangensaft, bitte.'",
      "Could you please tell me the language of this text: 'Mijn naam? Vertel ik lekker niet.'",
      "Please tell me the language of this text: '¿Dónde está la biblioteca?'",
      "Could you identify the language of the following: 'Grazie mille per tutto.'",
      "What language is this? 'Nao falo ingles.'",
      "Identify the language of the text: 'Я люблю программировать.'",
      "Could you please tell me the language of this phrase: 'ありがとう ございます.'",
      "What language is this? 'Saknar dig varje dag.'"
    ]
  },
  {
    "cluster_id": 9,
    "queries": [
      "Can you create a QR code image from this URL?",
      "Generate a QR code for this text string.",
      "Please provide a downloadable QR code for the given URL.",
      "I need a QR code image generated from this text.",
      "Convert this URL into a QR code image.",
      "Create a QR code from the following string.",
      "Make a QR code image that I can download using this URL.",
      "Generate a QR code for this input text.",
      "Can you produce a QR code image from this URL or string?",
      "Provide a QR code image for this text input.",
      "Create a printable QR code from the given URL.",
      "Generate and return a QR code image for this string.",
      "Turn this URL into a QR code that I can save as an image.",
      "I need a QR code generated from the following URL.",
      "Please provide a downloadable QR code image for this input text.",
      "Create a QR code from this string that I can save as an image.",
      "Make a QR code image from this website link.",
      "Generate and return a QR code for this URL.",
      "Can you produce a QR code from this text that I can download?",
      "I want to convert this URL into a QR code image.",
      "Please generate a QR code for this string and provide it as an image.",
      "Create a QR code for the following URL that I can print.",
      "Generate a QR code image from the given text input.",
      "Provide a QR code image based on this URL or string.",
      "Generate a downloadable QR code for the following text.",
      "I need a QR code for this website link.",
      "Please convert this string into a QR code image.",
      "Make a QR code that I can download for this URL.",
      "Create a QR code image from the given text.",
      "Turn this URL into a QR code graphic.",
      "Provide a QR code for this text input.",
      "Can you generate a printable QR code from this link?",
      "Give me a QR code image for this URL or string.",
      "Create a QR code from this URL that I can save as an image.",
      "Generate a QR code image based on this text.",
      "Please produce a QR code from the following URL or text.",
      "Can you generate a QR code image from this URL?",
      "Please create a QR code for this text string.",
      "I need a downloadable QR code for this website link.",
      "Generate a QR code image for the given URL.",
      "Create a QR code from this input text.",
      "Can you provide a QR code image based on this URL?",
      "Make a QR code that links to this webpage.",
      "Produce a QR code image from the following string.",
      "Convert this URL into a QR code image I can download.",
      "Generate a QR code image for this textual data.",
      "Create a scannable QR code from this URL.",
      "Please produce a QR code image that represents this string.",
      "I want to generate a QR code from the provided URL or text.",
      "Generate a QR code for the following text.",
      "I need a downloadable QR code for this web address.",
      "Create a QR code that links to this URL.",
      "Make a QR code from this text input.",
      "Provide me with a QR code image for this website link.",
      "Generate and download a QR code for the given URL.",
      "Turn this URL into a scannable QR code image.",
      "Produce a QR code image from this string value.",
      "Create a QR code for the following URL that I can save.",
      "Generate a QR code image from any text or URL I provide.",
      "Can you produce a QR code that encodes this URL or text?",
      "Please convert this URL into a QR code image.",
      "Create a QR code from the text I provide.",
      "Make a QR code that I can print from this URL.",
      "Generate a QR code image based on this string.",
      "Produce a QR code for this web address.",
      "Can you provide a QR code image generated from this URL?",
      "I want to turn this URL into a QR code image file.",
      "Create a QR code for the given text input.",
      "Please generate a QR code from this URL parameter.",
      "Convert this link into a QR code image that I can download.",
      "I need a downloadable QR code for this link.",
      "Create a QR code from this string of text.",
      "Make a QR code image that I can print from this URL.",
      "Can you produce a QR code based on this input text?",
      "Generate a QR code image for this website address.",
      "Please provide a QR code image for this text snippet.",
      "Make a QR code image from the following URL or text.",
      "I want a QR code generated from this string value.",
      "Provide me with a QR code image generated from this URL.",
      "Please generate a QR code for this text string.",
      "I need a QR code that links to this website.",
      "Generate a downloadable QR code image for this URL.",
      "Convert this text into a QR code image.",
      "Create a QR code from the following URL that I can print.",
      "Produce a QR code image based on this input string.",
      "Make a QR code for this link that I can save as a PNG.",
      "Turn this URL into a QR code image.",
      "Provide a QR code image generated from this text.",
      "Generate a QR code from this URL for me.",
      "Can you produce a QR code image from the given string?",
      "Please create a QR code that encodes this URL.",
      "Generate a downloadable QR code for this text.",
      "Please provide a QR code image for the given string.",
      "Make a QR code from this input text.",
      "Create a printable QR code for this URL.",
      "Can you produce a QR code image from this text?",
      "Generate a QR code that I can download for this string.",
      "I want to get a QR code image from this URL.",
      "Provide a QR code image generated from this text input.",
      "Please convert this URL into a QR code that I can save."
    ]
  },
  {
    "cluster_id": 10,
    "queries": [
      "What will the weather be like in Paris for the next two weeks?",
      "Can you provide a 14-day weather forecast for the coordinates 40.7128 latitude and -74.0060 longitude?",
      "Show me the daily weather forecast for the upcoming 16 days in London.",
      "Give me the weather forecast for the next 14 days for the city with postal code G2J.",
      "What is the predicted weather for the next two weeks at latitude 34.0522 and longitude -118.2437?",
      "Provide a 16-day weather forecast summary for New York City.",
      "Can I get a detailed weather forecast for the next 14 days for the location at latitude 51.5074 and longitude -0.1278?",
      "What is the extended weather forecast for the next two weeks in the area with ZIP code 10001?",
      "Please give me a 14-day weather outlook for the town identified by UK postcode SW1.",
      "Show the daily weather forecast for the next 16 days at coordinates 35.6895 latitude and 139.6917 longitude.",
      "What will the weather conditions be in Toronto for the next two weeks?",
      "Can you provide a two-week weather forecast for a location using its city name?",
      "Give me the weather forecast for the next 14 days for a specific place using latitude and longitude.",
      "Can you provide a 14-day weather forecast for Paris?",
      "What's the weather forecast for the next two weeks at latitude 40.7128 and longitude -74.0060?",
      "Give me the daily weather forecast for the next 16 days for coordinates 51.5074, -0.1278.",
      "Show me the upcoming 14-day weather outlook for New York City.",
      "I need a detailed weather forecast for the next two weeks for the postal code G2J.",
      "What's the weather prediction for the next 14 days near latitude 35.6895 and longitude 139.6917?",
      "Provide the forecast summary for the next 16 days at longitude 2.3522 and latitude 48.8566.",
      "Get me the weather forecast for the next two weeks for the city of London.",
      "Can you fetch the 14-day weather forecast for the zip code 10001?",
      "Give me the daily weather forecast for the next 16 days for coordinates -33.8688, 151.2093.",
      "What is the weather forecast for the next two weeks in SW1 postcode area?",
      "Show me the 14-day weather forecast for the location at latitude 55.7558 and longitude 37.6173.",
      "I'd like a weather forecast for the next 14 days using the IATA airport code DXB.",
      "What is the 14-day weather forecast for Paris?",
      "Can you provide the hourly weather forecast for coordinates 40.7128 latitude and -74.0060 longitude?",
      "Show me the weather forecast for the next two weeks in London using the postal code SW1.",
      "Give me the 16-day weather forecast for latitude 34.0522 and longitude -118.2437.",
      "What will the weather be like tomorrow in New York City?",
      "Provide the weather forecast and any weather alerts for the next 14 days in Tokyo.",
      "What's the daily weather prediction for the next two weeks at coordinates 51.5074 latitude and -0.1278 longitude?",
      "Show me the weather forecast for the next 14 days for the zip code 10001.",
      "Can you get the weather forecast for the next 16 days at latitude 48.8566 and longitude 2.3522?",
      "What is the weather outlook for the next 14 days in Sydney?",
      "Give me the hourly and daily weather forecast for the next two weeks for the location with postal code G2J.",
      "Retrieve the weather forecast for the next 14 days including any weather alerts for the city of Mumbai.",
      "Provide a detailed weather forecast for the next 14 days including temperature, precipitation, and wind speed for coordinates 35.6895 latitude and 139.6917 longitude.",
      "What is the weather forecast for the next two weeks in Paris?",
      "Can you provide a 14-day weather outlook for coordinates 40.7128 latitude and -74.0060 longitude?",
      "Give me the daily weather forecast for the next 16 days at latitude 51.5074 and longitude -0.1278.",
      "Show me the weather forecast including hourly data for the next 14 days for zip code 10001.",
      "What will the weather be like over the next two weeks in London?",
      "Provide the 16-day weather summary for coordinates latitude 34.0522 and longitude -118.2437.",
      "Give me the weather forecast for the next 14 days for the city of Toronto.",
      "What is the extended weather forecast for the upcoming 14 days at latitude 48.8566 and longitude 2.3522?",
      "Show the daily weather predictions for the next 16 days for the location with postal code G2J.",
      "Get the weather forecast for the next two weeks for a location based on IP address 100.0.0.1.",
      "Provide hourly and daily weather forecasts for the next 14 days for the city of Sydney.",
      "What are the expected weather conditions for the next 16 days at latitude 35.6895 and longitude 139.6917?",
      "Give me a detailed weather forecast including alerts for the next 14 days for the coordinates 55.7558 latitude and 37.6173 longitude.",
      "What's the weather forecast for the next two weeks in Paris?",
      "Can you provide a 14-day weather outlook for the coordinates 40.7128 latitude and -74.0060 longitude?",
      "Show me the daily weather forecast for the upcoming 16 days at latitude 51.5074 and longitude -0.1278.",
      "I need the weather predictions for the next two weeks in the city of Tokyo.",
      "Give me a detailed 14-day weather forecast for the location with latitude 34.0522 and longitude -118.2437.",
      "What will the weather be like over the next 15 days in New York City?",
      "Provide the daily weather forecast for the next 16 days for coordinates 48.8566 latitude and 2.3522 longitude.",
      "What's the weather forecast for the next two weeks for the postal code G2J in Canada?",
      "Give me the detailed weather forecast for the next 14 days for the US zip code 10001.",
      "Can you get me the long-term weather forecast for the next 16 days at latitude 35.6895 and longitude 139.6917?",
      "Please provide the next 14 days of weather forecast and alert information for London.",
      "What is the 16-day weather outlook for the area located at latitude 55.7558 and longitude 37.6173?",
      "Show me the upcoming two-week weather forecast for a location by entering its latitude and longitude.",
      "Can you provide a 14-day weather forecast for the coordinates latitude 40.7128 and longitude -74.0060?",
      "Give me the daily weather forecast for the upcoming 16 days at latitude 51.5074 and longitude -0.1278.",
      "What's the weather outlook for the next 14 days in the city with postal code G2J?",
      "Provide the detailed weather forecast including hourly data for the next two weeks for New York City.",
      "Show me the weather forecast for the next 14 days based on the IP address 100.0.0.1.",
      "Can I get a 16-day weather forecast for the location at latitude 35.6895 and longitude 139.6917?",
      "What's the weather prediction for the next two weeks for the UK postcode SW1?",
      "Give me the extended daily weather forecast for the next 14 days for the airport with IATA code DXB.",
      "Provide a detailed weather forecast including day and night data for the next 14 days in London.",
      "Can you show me the 14-day weather forecast with air quality data for a given city?",
      "What will the weather be like over the next 16 days in the area located at latitude -33.8688 and longitude 151.2093?",
      "Get me the upcoming two weeks weather forecast with hourly information for a specified location by city name.",
      "Can you provide the daily weather forecast for the next two weeks in New York City?",
      "Give me the weather forecast for the next 16 days at latitude 34.05 and longitude -118.25.",
      "What will the weather be like in London for the next two weeks?",
      "Show me the hourly weather forecast for the next 14 days in Tokyo.",
      "Provide the weather forecast for the next 14 days for the postal code G2J in Canada.",
      "Can you get the weather forecast for the next 16 days for coordinates 51.5074, -0.1278?",
      "What is the expected weather in Sydney for the upcoming two weeks?",
      "Give me the weather alert and forecast for the next 14 days in Berlin.",
      "Tell me the daily weather forecast for the next 16 days at latitude 40.7128 and longitude -74.0060.",
      "What is the 14-day weather forecast including temperature and precipitation for Rome?",
      "Provide a detailed weather forecast for the next two weeks for zip code 10001 in the US.",
      "Show the weather prediction for the next 14 days for the city of Mumbai.",
      "Can you provide a 16-day weather forecast for the coordinates latitude 40.7128 and longitude -74.0060?",
      "Show me the daily weather forecast for the upcoming two weeks in London.",
      "I need the weather forecast including hourly details for the next 14 days at latitude 34.0522 and longitude -118.2437.",
      "Give me the weather alert and forecast summary for New York City for the next 14 days.",
      "What will the weather be like for the next 16 days at latitude 51.5074 and longitude -0.1278?",
      "Provide the extended weather forecast and air quality data for the next two weeks for a given city.",
      "Can you give me the daily and hourly weather forecast for the next 14 days in Tokyo?",
      "What is the upcoming 14-day weather forecast at latitude 48.8566 and longitude 2.3522?",
      "I want a detailed weather forecast with astronomy data for the next 14 days in Sydney.",
      "Give me the weather forecast and any weather alerts for the next two weeks for the location specified by postal code G2J.",
      "Provide a 16-day weather forecast including precipitation and wind speed for coordinates lat 35.6895, lon 139.6917."
    ]
  }
]