[
  {
    "cluster_id": 1,
    "queries": [
      "Can you provide the latitude and longitude for 1600 Pennsylvania Avenue NW, Washington, D.C.?",
      "I need to find the geographic coordinates for the Eiffel Tower in Paris, France.",
      "What are the coordinates for the address: 1 Infinite Loop, Cupertino, CA?",
      "Could you get me the lat,lng coordinates for the Great Wall of China?",
      "I'd like to know the geocoordinates for the Sydney Opera House, please.",
      "Can you convert this address into latitude and longitude: 350 5th Ave, New York, NY 10118, USA?",
      "Please provide the lat,lng coordinates for the address: 4 Pennsylvania Plaza, New York, NY 10001, USA.",
      "I need the geocoordinates for the Pyramids of Giza in Egypt.",
      "Can you tell me the latitude and longitude of 221B Baker Street, London, UK?",
      "Find the geographic coordinates for the address: 11 Wall St, New York, NY 10005, USA."
    ]
  },
  {
    "cluster_id": 2,
    "queries": [
      "What is the address for the coordinates 37.7749 N, 122.4194 W?",
      "Could you provide the address for the latitude 51.5074 and longitude -0.1278?",
      "Can I get the location for the geographical coordinates of 40.7128 N, 74.0060 W?",
      "What's the corresponding address for lat 48.8566 and lon 2.3522?",
      "Can you tell me the address of the place located at 41.9028 N, 12.4964 E?",
      "I have the coordinates 35.6895 N, 139.6917 E, can you give me the address?",
      "What is the location for the GPS coordinates 28.6139 N, 77.2090 E?",
      "Can you find the address for the position with latitude 34.0522 and longitude -118.2437?",
      "What's the place located at the coordinates 55.7558 N, 37.6176 E?",
      "Can I know the address for the location with latitude 43.6532 and longitude -79.3832?"
    ]
  },
  {
    "cluster_id": 3,
    "queries": [
      "What languages can be translated using these tools?",
      "Can you provide a list of all supported source languages for translation?",
      "Which languages are currently supported by these translation APIs?",
      "Can you tell me the languages these translation tools can work with?",
      "I need a list of all languages that these translation services can handle.",
      "What are the possible languages for translation on these platforms?",
      "Can you show me the languages that these translation tools support?",
      "What are the source languages that are supported by these translation APIs?",
      "I'm looking for the languages that can be translated by these tools. Can you help?",
      "Which languages are available for translation on these platforms?"
    ]
  },
  {
    "cluster_id": 4,
    "queries": [
      "What is the geolocation of my current IP address?",
      "Can I get the location details for the IP address 192.168.1.1?",
      "What geographical information can I find for the IP 172.16.254.1?",
      "Could you provide the location details of the IP address 10.0.0.1?",
      "What's the city and country of the IP 192.0.2.0?",
      "Can I track the location of the IP 203.0.113.0?",
      "I'd like to know the geolocation of IP 198.51.100.0, please.",
      "Can you find the details for the IP address 203.0.113.0?",
      "Could you look up the location information for IP 198.51.100.0?",
      "What's the location and other details of the IP 192.0.2.0?"
    ]
  },
  {
    "cluster_id": 5,
    "queries": [
      "What is the WHOIS information for the domain google.com?",
      "Can you retrieve the domain registry information for the domain name amazon.com?",
      "I need to know the WHOIS details for the domain name microsoft.com. Could you fetch them for me?",
      "Could you check the domain registration details for the domain apple.com?",
      "Please find out the WHOIS record's history for the domain netflix.com.",
      "I would like to check the domain info for the domain name reddit.com. Can you help me with that?",
      "What are the WHOIS details for the domain facebook.com?",
      "Can you get me the domain registry information for the domain name instagram.com?",
      "I need the WHOIS information for the domain twitter.com. Could you retrieve them for me?",
      "Could you provide the domain registration details for the domain name linkedin.com?"
    ]
  },
  {
    "cluster_id": 6,
    "queries": [
      "Can you check if my email address is valid?",
      "Verify the correctness of this email address for me.",
      "Can these bunch of emails be validated?",
      "I need to know if this email address is real and valid.",
      "Can you validate this email address for me?",
      "Is this email address correctly formatted?",
      "I need to confirm if this email address exists.",
      "Can you help me check the deliverability of this email address?",
      "Is this email address deliverable?",
      "I need to verify if this email address is usable."
    ]
  },
  {
    "cluster_id": 7,
    "queries": [
      "What is the sentiment of the text 'I love this product!'?",
      "Could you analyze the sentiment of the statement 'I am not happy with the service'?",
      "Can you determine the sentiment of 'This is the best day of my life!'?",
      "What is the sentiment score for 'This is a terrible experience'?",
      "Can you provide the sentiment analysis for 'I am extremely satisfied with the quality'?",
      "What is the sentiment conveyed in the text 'This is the worst movie I have ever seen'?",
      "Can you assess the sentiment of 'The food was absolutely delicious'?",
      "What is the sentiment rating for 'I am disappointed with the room service'?",
      "Can you analyze the sentiment of 'I'm so excited about the concert'?",
      "What's the sentiment score for 'I can't stand this weather'?"
    ]
  },
  {
    "cluster_id": 8,
    "queries": [
      "What language is this text in?",
      "Do you know what language this is?",
      "Can you determine the language of this text?",
      "Identify the language of this passage, please.",
      "Please tell me what language this is.",
      "Can you help detect the language of this text?",
      "What is the language of this given text?",
      "Please identify the language of this text.",
      "Could you determine what language this passage is?",
      "Help me figure out the language of this text."
    ]
  },
  {
    "cluster_id": 9,
    "queries": [
      "Can you generate a QR code for my website?",
      "I need a QR code for a specific URL, can the tool create it?",
      "Can I get a QR code for this string of text?",
      "Can I generate a QR code for my business website?",
      "Could you create a QR code for my online store?",
      "I need to convert this URL into a QR code, can the tool do it?",
      "Is it possible to get a QR code for my blog?",
      "I wish to create a QR code for my personal website, can the tool help?",
      "Can you provide a QR code for this online article?",
      "I have a URL here, can you generate a QR code for it?"
    ]
  },
  {
    "cluster_id": 10,
    "queries": [
      "What are all the available currencies I can convert?",
      "Can you list all the currencies supported for conversion?",
      "I need a list of all currencies available for exchange.",
      "Which currencies can I use for conversion?",
      "Can you provide me with a list of supported currencies for conversion?",
      "What are the available currencies for foreign exchange?",
      "I want to know all the currencies available for exchange rates.",
      "Show me all the currencies that I can convert.",
      "List all the available currencies for conversion.",
      "Which currencies are supported for forex and crypto conversion?"
    ]
  }
]